Repository: 18773262/qteasy
Catalog: docs/source/locale/*/LC_MESSAGES/getting_started.po
Languages: es, fr

source: `qteasy`将在同一段历史数据（优化区间）上反复回测，找到结果最好的30组参数，并把这30组参数在另一段历史数据（测试区间）上进行独立测试，并显 示独立测试的结果：
es: `qteasy` realizará backtesting repetido en el mismo conjunto de datos históricos (rango de optimización) para encontrar las 30 mejores combinaciones de parámetros, y probará estas 30 combinaciones de parámetros en otro conjunto de datos históricos (rango de prueba) de forma independiente, y mostrará los resultados de la prueba independiente:
fr: `qteasy` effectuera des backtests répétés sur la même période de données historiques (période d'optimisation), trouvera les 30 meilleurs résultats de paramètres, et testera ces 30 groupes de paramètres sur une autre période de données historiques (période de test) pour afficher les résultats du test indépendant :

source: 结果如下：
es: Los resultados son los siguientes:
fr: Les résultats sont les suivants :

source: 关于策略优化结果的更多解读、以及更多优化参数的介绍，请参见详细文档
es: Para obtener más información sobre la interpretación de los resultados de la optimización de la estrategia y más información sobre la optimización de parámetros, consulte la documentación detallada
fr: Pour plus d'informations sur l'interprétation des résultats de l'optimisation de la stratégie, et pour plus d'informations sur l'optimisation des paramètres, veuillez consulter la documentation détaillée

source: 部署并开始交易策略的实盘运行
es: Implementación y ejecución en vivo de la estrategia de trading
fr: Déploiement et démarrage de l'exécution

source: 在配置好`Operator`对象并设置好策略后，`qteasy`可以自动定期运行、自动盯盘、自动下载实时数据并根据策略结果生成交易指令，模拟交易过程并记录交易结果。
es: Después de configurar el objeto `Operator` y configurar la estrategia, `qteasy` puede ejecutarse automáticamente periódicamente, monitorear automáticamente, descargar datos en tiempo real automáticamente y generar instrucciones de trading según los resultados de la estrategia, simular el proceso de trading y registrar los resultados de trading.
fr: Après avoir configuré l'objet `Operator` et défini la stratégie, `qteasy` peut fonctionner automatiquement à intervalles réguliers, surveiller automatiquement, télécharger automatiquement les données en temps réel et générer des ordres de trading en fonction des résultats de la stratégie, simuler le processus de trading et enregistrer les résultats de trading.

source: `Qteasy`的实盘一旦启动，就会在`terminal`中启动一个单独的线程在后台运行，运行的时机也是跟真实的股票市场一致的，股票市场收市的时候不运行，交易日早上9点15分唤醒系统开始拉取实时股价，9点半开始运行交易策略，交易策略的运行时机和运行频率在策略的属性中设置。如果策略运行的结果产生交易信号，则根据交易信号模拟挂单，挂单成交后修改响应账户资金和股票持仓，交易费用按照设置中的费率扣除。如果资金不足或持仓不足会导致交易失败，当天买入的股票同真实市场一样T+1交割，第二个交易日开始前交割完毕。
es: Una vez que se inicia el trading en vivo de `Qteasy`, se ejecutará un hilo separado en segundo plano en el `terminal`, y el momento de ejecución es consistente con el mercado de valores real, no se ejecutará cuando el mercado de valores esté cerrado, el sistema se activará para obtener los precios de las acciones en tiempo real a las 9:15 a.m., y comenzará a ejecutar la estrategia de trading a las 9:30 a.m., el momento y la frecuencia de ejecución de la estrategia de trading se establecen en las propiedades de la estrategia. Si la estrategia de trading genera señales de trading, se simularán órdenes según las señales de trading, y una vez que se ejecuten las órdenes, se modificarán los fondos y las posiciones de las acciones de la cuenta correspondiente, y se deducirán las tarifas de trading según la tasa establecida. Si no hay suficientes fondos o posiciones, la operación fallará, las acciones compradas el mismo día se liquidarán T+1, y se liquidarán antes del segundo día de trading.
fr: Une fois que le trading en direct de `Qteasy` est démarré, un thread distinct s'exécute en arrière-plan dans le `terminal`, le moment de l'exécution est également conforme au marché boursier réel, il ne fonctionne pas lorsque le marché boursier est fermé, le système est réveillé à 9h15 le matin pour commencer à extraire les prix des actions en temps réel, et à 9h30 pour commencer à exécuter la stratégie de trading, l'heure et la fréquence d'exécution de la stratégie de trading sont définies dans les attributs de la stratégie. Si les résultats de l'exécution de la stratégie génèrent des signaux de trading, des ordres simulés sont passés en fonction des signaux de trading, les ordres passés sont exécut

source: 完成上述设置后，使用下面的代码运行交易策略。
es: Después de completar la configuración anterior, use el siguiente código para ejecutar la estrategia de trading.
fr: Après avoir terminé la configuration ci-dessus, utilisez le code suivant pour exécuter la stratégie de trading.

source: `Qteasy`的实盘运行使用了“账户”的概念，就跟您在股票交易市场开户一样，一个账户可以有自己的持有资金，股票持仓，单独计算盈亏。运行过程中您可以随时终止程序，这时所有的交易记录都会保存下来，下次重新启动时，只要引用上一次运行使用的账户ID（account ID）就可以从上次中断的地方继续运行了，包括交易策略的参数等信息都会从上次停止的地方重新启动，因此启动时需要指定账户，如果不想继续上次的账户，可以新开一个账户运行，或者删除当前账户下的所有记录重新开始交易。
es: `Qteasy` utiliza el concepto de "cuenta" para el trading en vivo, al igual que abrir una cuenta en el mercado de valores, una cuenta puede tener su propio capital, posiciones de acciones, y calcular las ganancias y pérdidas por separado. Puede detener el programa en cualquier momento durante la ejecución, y todos los registros de trading se guardarán, la próxima vez que lo inicie, solo necesita hacer referencia al ID de cuenta (account ID) utilizado la última vez para continuar desde donde se detuvo la última vez, incluidos los parámetros de la estrategia de trading y otra información se reiniciarán desde donde se detuvieron la última vez, por lo tanto, necesita especificar la cuenta al iniciar, si no desea continuar con la cuenta anterior, puede abrir una nueva cuenta para ejecutar, o eliminar todos los registros de la cuenta actual y comenzar de nuevo.
fr: Le trading en direct de `Qteasy` utilise le concept de "compte", tout comme l'ouverture d'un compte sur le marché boursier, un compte peut avoir son propre capital, ses positions en actions, et calculer les profits et les pertes séparément. Vous pouvez arrêter le programme à tout moment pendant Au cours de l'exécution, tous les enregistrements de trading seront sauvegardés, la prochaine fois que vous redémarrez, vous pouvez reprendre à partir de l'endroit où vous vous êtes arrêté la dernière fois en référençant l'ID de compte (account ID) utilisé lors de la dernière exécution, y compris les paramètres de la stratégie de trading et d'autres informations seront redémarrés à partir de l'endroit où vous vous êtes arrêté la dernière fois. Par conséquent, vous devez spécifier un compte lors du démarrage, si vous ne souhaitez pas continuer avec le compte précédent, vous pouvez créer un nouveau compte pour exécuter, ou supprimer tous les enregistrements sous le compte actuel et recommencer le trading.

source: 在启动实盘时可以通过`qteasy`的系统配置变量`live_trade_account_name`来指定使用的账户名，系统会自动创建一个新的账户并赋予账户ID；如果想要使用已有的账户，可以在启动时通过`live_trade_account_id`指定账户ID。
es: Al iniciar el trading en vivo, puede especificar el nombre de la cuenta que se utilizará mediante la variable de configuración del sistema `live_trade_account_name` de `qteasy`, el sistema creará automáticamente una nueva cuenta y le asignará un ID de cuenta; si desea utilizar una cuenta existente, puede especificar el ID de cuenta al iniciar mediante `live_trade_account_id`.
fr: Lors du démarrage du trading en direct, vous pouvez spécifier le nom du compte à utiliser en utilisant la variable de configuration système `live_trade_account_name` de `qteasy`, le système créera automatiquement un nouveau compte et lui attribuera un ID de compte ; si vous souhaitez utiliser un compte existant, vous pouvez spécifier l'ID de compte lors du démarrage en utilisant `live_trade_account_id`.

source: 如果您希望通过命令行方式在Terminal中启动`qteasy`并直接开始实盘交易，您可以创建一个脚本文件，并在Terminal中通过命令行启动交易。 `qteasy`提供了几个实盘交易脚本文件的示例，您可以在`qteasy`的安装目录下的`examples`文件夹中找到这些脚本文件，并使用下面的命令启动实盘交易：
es: Si desea iniciar el trading en vivo de `qteasy` a través de la línea de comandos en el Terminal y comenzar a operar en vivo directamente, puede crear un archivo de script y iniciar el trading a través de la línea de comandos en el Terminal. `qteasy` proporciona varios ejemplos de scripts de trading en vivo, puede encontrar estos archivos de script en la carpeta `examples` en el directorio de instalación de `qteasy`, y puede iniciar el trading en vivo con el siguiente comando:
fr: Si vous souhaitez démarrer le trading en direct de `qteasy` via la ligne de commande dans le Terminal et commencer le trading en direct directement, vous pouvez créer un fichier de script et démarrer le trading via la ligne de commande dans le Terminal. `qteasy` fournit plusieurs exemples de fichiers de script de trading en direct, vous pouvez trouver ces fichiers de script dans le dossier `examples` du répertoire d'installation de `qteasy`, et démarrer le trading en direct en utilisant la commande suivante :

source: 上面的命令将启动一个实盘交易，使用账户ID为18，使用CLI界面监控实盘交易。
es: El comando anterior iniciará un trading en vivo, utilizando el ID de cuenta 18, y monitoreará el trading en vivo a través de la interfaz de línea de comandos.
fr: La commande ci-dessus démarrera un trading en direct, utilisera l'ID de compte 18, et utilisera l'interface CLI pour surveiller le trading en direct.

source: `qteasy`提供了两种不同的用户界面以运行实盘交易：
es: `qteasy` proporciona dos interfaces de usuario diferentes para ejecutar trading en vivo:
fr: `qteasy` propose deux interfaces utilisateur différentes pour exécuter le trading en direct :

source: **`TraderApp`** (v1.2.0新增) 交互式图形界面，可以在图形界面中查看交易日志、查看持仓、查看账户资金变化等信息 ![png](examples/img/trader_app_light_theme.png) ![png](examples/img/trader_app_2.png)
es: **`TraderApp`** (añadido en v1.2.0) Interfaz gráfica interactiva, puede ver el registro de trading, ver las posiciones, ver los cambios en los fondos de la cuenta, etc. en la interfaz gráfica ![png](examples/img/trader_app_light_theme.png) ![png](examples/img/trader_app_2.png)
fr: **`TraderApp`** (ajouté dans la version 1.2.0) Interface graphique interactive, vous pouvez afficher les journaux de trading, les positions, les changements de fonds du compte, etc. dans l'interface graphique ![png](examples/img/trader_app_light_theme.png) ![png](examples/img/trader_app_2.png)

source: 上面两种方式都可以在实盘运行时使用，根据`qteasy`的配置参数进入不同的交互界，关于更多实盘运行的介绍，请参见[`QTEASY`文档](https://qteasy.readthedocs.io)
es: Ambos métodos anteriores se pueden utilizar durante el trading en vivo, y se puede acceder a diferentes interfaces interactivas según los parámetros de configuración de `qteasy`, para obtener más información sobre el trading en vivo, consulte la [documentación de `QTEASY`](https://qteasy.readthedocs.io)
fr: Les deux méthodes ci-dessus peuvent être utilisées pendant le trading en direct, et vous pouvez accéder à des interfaces interactives différentes en fonction des paramètres de configuration de `qteasy`, pour plus d'informations sur le trading en direct, veuillez consulter la [documentation `QTEASY`](https://qteasy.readthedocs.io)

source: **`TraderShell`** 交互式命令行界面，可以在命令行中输入命令，查看交易日志、查看持仓、查看账户资金变化等信息： ![png](img/output_27_1.png) ![png](img/output_27_3.png)
fr: **`TraderShell`** Interface de ligne de commande interactive, vous pouvez entrer des commandes dans la ligne de commande pour afficher les journaux de trading, les positions, les changements de fonds du compte, etc. : ![png](img/output_27_1.png) ![png](img/output_27_3.png)
