Repository: 18773262/qteasy
Catalog: docs/source/locale/*/LC_MESSAGES/getting_started.po
Languages: es, fr

source: QTEASY快速上手指南
es: Guía de inicio rápido de QTEASY
fr: Guide de démarrage rapide QTEASY

source: 安装及依赖
es: Instalación y dependencias
fr: Installation et dépendances

source: 通过`pip`安装
es: Instalación mediante `pip`
fr: Installation via `pip`

source: python 版本
es: Versión de Python
fr: Version de Python

source: *`python` version >= 3.6, <3.13*
es: *`python` versión >= 3.6, <3.13*

source: 安装依赖包
es: Instalación de paquetes de dependencias
fr: Installation des dépendances

source: `qteasy`所有必要的依赖包都可以在`pip`安装的同时安装好，但某些特殊情况下，您需要在安装时指定可选依赖包，以便在安装`qteasy`时同时安装，或者手动安装依赖包：
es: `qteasy` todos los paquetes de dependencias necesarios se pueden instalar al mismo tiempo que `pip`, pero en algunos casos especiales, es posible que necesite especificar paquetes de dependencias opcionales al instalar `qteasy` para instalar al mismo tiempo, o instalar manualmente los paquetes de dependencias:
fr: Toutes les dépendances nécessaires à `qteasy` peuvent être installées en même temps que `pip`, mais dans certains cas spécifiques, vous devez spécifier les dépendances facultatives lors de l'installation, afin de les installer en même temps que `qteasy`, ou de les installer manuellement :

source: **`pymysql`**, 从`v1.4`开始，`pymysql`以及`db-utils`已经成为`qteasy`的默认依赖包，无需额外安装
es: **`pymysql`**, Desde `v1.4`, `pymysql` y `db-utils` se han convertido en paquetes de dependencias predeterminados de `qteasy`, no es necesario instalarlos por separado
fr: **`pymysql`**, À partir de `v1.4`, `pymysql` et `db-utils` sont devenus des dépendances par défaut de `qteasy`, pas besoin de les installer séparément

source: **`pyarrow`**, 用于操作`feather`文件，将本地数据存储为`feather`文件，`pyarrow`可以在安装`qteasy`时自动安装，也可以手动安装：
es: **`pyarrow`**, para operar archivos `feather`, almacenar datos locales como archivos `feather`, `pyarrow` se puede instalar automáticamente al instalar `qteasy`, o se puede instalar manualmente:
fr: **`pyarrow`**, Utilisé pour manipuler les fichiers `feather`, stocker les données locales dans des fichiers `feather`, `pyarrow` peut être installé automatiquement lors de l'installation

source: **`pytables`**, 用于操作`HDF`文件，将本地数据存储到`HDF`文件，`pytables`不能自动安装，需要使用`conda`手动安装`pytables`：
es: **`pytables`**, para operar archivos `HDF`, almacenar datos locales en archivos `HDF`, `pytables` no se puede instalar automáticamente, necesita instalar `pytables` manualmente con `conda`:
fr: **`pytables`**, Utilisé pour manipuler les fichiers `HDF`, stocker les données locales dans des fichiers `HDF`, `pytables` ne peut pas être installé automatiquement, vous devez l'installer manuellement avec `conda` :

source: **`ta-lib`**, 以便使用所有的内置交易策略，下面的方法可以安装`ta-lib API`，但它还依赖C语言的`TA-Lib`包，安装方法请参考[FAQ](https://qteasy.readthedocs.io/zh/latest/faq.html#id2)
es: **`ta-lib`**, para usar todas las estrategias de trading integradas, el siguiente método puede instalar `ta-lib API`, pero también depende del paquete `TA-Lib` en C, consulte el método de instalación en [FAQ](https://qteasy.readthedocs.io/zh/latest/faq.html#id2)
fr: **`ta-lib`**, pour utiliser toutes les stratégies de trading intégrées, la méthode suivante peut être utilisée pour installer l'API `ta-lib`, mais elle dépend également du package `TA-Lib` en C, veuillez vous référer à la méthode d'installation dans [FAQ](https://qteasy.readthedocs.io/zh/latest/faq.html#id2)

source: 10分钟了解qteasy的功能
es: Conozca las funciones de qteasy en 10 minutos
fr: 10 minutes pour comprendre les fonctionnalités de qteasy

source: 导入`qteasy`
es: Importar `qteasy`
fr: Importer `qteasy`

source: 基本的模块导入方法如下
es: La forma básica de importar módulos es la siguiente
fr: La méthode d'importation de base du module est la suivante

source: 配置本地数据源和tushare token
es: Configurar la fuente de datos local y el token de tushare
fr: Configurer la source de données locale et le jeton tushare

source: 为了使用`qteasy`，需要大量的金融历史数据，所有的历史数据都必须首先保存在本地，如果本地没有历史数据，那么`qteasy`的许多功能就无法执行。
es: Para usar `qteasy`, se necesita una gran cantidad de datos históricos financieros, todos los datos históricos deben guardarse primero localmente, si no hay datos históricos locales, muchas funciones de `qteasy` no se pueden ejecutar.
fr: Pour utiliser `qteasy`, vous avez besoin de beaucoup de données historiques financières, toutes les données historiques doivent d'abord être stockées localement, si vous n'avez pas de données historiques locales, de nombreuses fonctionnalités de `qteasy` ne peuvent pas être exécutées.

source: `qteasy`可以通过`tushare`金融数据包来获取大量的金融数据，用户需要自行申请`API Token`，获取相应的权限和积分（详情参考：https://tushare.pro/document/2）
es: `qteasy` puede obtener una gran cantidad de datos financieros a través del paquete de datos financieros `tushare`, los usuarios deben solicitar un `API Token`, obtener los permisos y puntos correspondientes (consulte los detalles en: https://tushare.pro/document/2)
fr: `qteasy` peut obtenir de nombreuses données financières via le package de données financières `tushare`, les utilisateurs doivent demander un `API Token`, obtenir les autorisations et les points correspondants (voir : https://tushare.pro/document/2)

source: 因此，在使用`qteasy`之前需要对本地数据源和`tushare`进行必要的配置。在`QT_ROOT_PATH/qteasy/`路径下打开配置文件`qteasy.cfg`，可以看到下面内容：
es: Por lo tanto, antes de usar `qteasy`, es necesario configurar la fuente de datos local y `tushare`. Abra el archivo de configuración `qteasy.cfg` en la ruta `QT_ROOT_PATH/qteasy/`, puede ver el siguiente contenido:
fr: Par conséquent, avant d'utiliser `qteasy`, vous devez configurer la source de données locale et `tushare`. Ouvrez le fichier de configuration `qteasy.cfg` dans le chemin `QT_ROOT_PATH/qteasy/`, vous pouvez voir le contenu suivant :

source: 配置`tushare token`
es: Configurar `tushare token`
fr: Configurer le jeton tushare

source: 将你获得的tushare API token添加到配置文件中，如下所示：
es: Agregue el token de API tushare que obtuvo al archivo de configuración, como se muestra a continuación:
fr: Ajoutez le jeton tushare API que vous avez obtenu au fichier de configuration, comme indiqué ci-dessous :

source: 配置本地数据源 —— 用MySQL数据库作为本地数据源
es: Configurar la fuente de datos local - Utilizar una base de datos MySQL como fuente de datos local
fr: Configurer la source de données locale - Utiliser une base de données MySQL comme source de données locale

source: 默认情况下`qteasy`使用存储在`data/`路径下的`.csv`文件作为数据源，不需要特殊设置。 如果设置使用`mysql`数据库作为本地数据源，在配置文件中添加以下配置：
es: De forma predeterminada, `qteasy` utiliza archivos `.csv` almacenados en la ruta `data/` como fuente de datos, no es necesario realizar ninguna configuración especial. Si se configura para utilizar una base de datos `mysql` como fuente de datos local, agregue la siguiente configuración al archivo de configuración:
fr: Par défaut, `qteasy` utilise les fichiers `.csv` stockés dans le chemin `data/` comme source de données, aucune configuration spéciale n'est nécessaire. Si vous souhaitez utiliser une base de données `mysql` comme source de données locale, ajoutez la configuration suivante dans le fichier de configuration :

source: 关闭并保存好配置文件后，重新导入`qteasy`，就完成了数据源的配置，可以开始下载数据到本地了。
es: Después de cerrar y guardar el archivo de configuración, vuelva a importar `qteasy`, la configuración de la fuente de datos está completa, y puede comenzar a descargar datos localmente.
fr: Après avoir fermé et enregistré le fichier de configuration, réimportez `qteasy`, la configuration de la source de données est terminée, vous pouvez commencer à télécharger les données localement.

source: 下载金融历史数据
es: Descargar datos históricos financieros
fr: Télécharger des données historiques financières

source: 要下载金融价格数据，使用`qt.refill_data_source()`函数。下面的代码下载2021及2022两年内所有股票、所有指数的日K线数据，同时下载所有的股票和基金的基本信息数据。 （根据网络速度，下载数据可能需要十分钟左右的时间，如果存储为csv文件，将占用大约200MB的磁盘空间）：
es: Para descargar datos de precios financieros, use la función `qt.refill_data_source()`. El siguiente código descarga los datos de K-line diarios de todas las acciones e índices en 2021 y 2022, y al mismo tiempo descarga los datos de información básica de todas las acciones y fondos. (Según la velocidad de la red, la descarga de datos puede tardar unos diez minutos, y si se almacena como un archivo csv, ocupará aproximadamente 200 MB de espacio en disco):
fr: Pour télécharger des données de prix financières, utilisez la fonction `qt.refill_data_source()`. Le code suivant télécharge les données K-line quotidiennes de toutes les actions et tous les indices de 2021 et 2022, et télécharge également les données d'informations de base de toutes les actions et fonds. (En fonction de la vitesse du réseau, le téléchargement des données peut prendre environ dix minutes. Si elles sont stockées dans un fichier csv, elles occuperont environ 200 Mo d'espace disque) :

source: 数据下载到本地后，可以使用`qt.get_history_data()`来获取数据，如果同时获取多个股票的历史数据，每个股票的历史数据会被分别保存到一个`dict`中。
es: Después de descargar los datos localmente, puede usar `qt.get_history_data()` para obtener los datos. Si obtiene los datos históricos de varias acciones al mismo tiempo, los datos históricos de cada acción se guardarán en un `dict` por separado.
fr: Une fois les données téléchargées localement, vous pouvez utiliser `qt.get_history_data()` pour obtenir les données. Si vous obtenez les données historiques de plusieurs actions en même temps, les données historiques de chaque action seront enregistrées séparément dans un `dict`.

source: 运行上述代码会得到一个`Dict`对象，包含两个股票"000001.SZ"以及"000005.SZ"的K线数据（数据存储为`DataFrame`）：
es: Ejecutar el código anterior devolverá un objeto `Dict` que contiene los datos de K-line de dos acciones "000001.SZ" y "000005.SZ" (los datos se almacenan como `DataFrame`):
fr: Exécuter le code ci-dessus renverra un objet `Dict` contenant les données K-line de deux actions "000001.SZ" et "000005.SZ" (les données sont stockées sous forme de `DataFrame`) :

source: 除了价格数据以外，`qteasy`还可以下载并管理包括财务报表、技术指标、基本面数据等在内的大量金融数据，详情请参见[QTEASY教程：金融数据下载及管理](https://github.com/shepherdpp/qteasy/blob/master/tutorials/Tutorial%2002%20-%20金融数据获取及管理.md)
es: Además de los datos de precios, `qteasy` también puede descargar y administrar una gran cantidad de datos financieros, incluidos informes financieros, indicadores técnicos, datos fundamentales, etc., consulte [QTEASY Tutorial: Descarga y gestión de datos financieros](
fr: En plus des données de prix, `qteasy` peut également télécharger et gérer une grande quantité de données financières, y compris les rapports financiers, les indicateurs techniques, les données fondamentales, etc. Pour plus de détails, veuillez consulter [QTEASY教程：金融数据下载及管理](

source: 股票的数据下载后，使用`qt.candle()`可以显示股票数据K线图。
es: Después de descargar los datos de las acciones, puede usar `qt.candle()` para mostrar el gráfico de K-line de los datos de las acciones.
fr: Après le téléchargement des données des actions, vous pouvez afficher le graphique K-line des données des actions en utilisant `qt.candle()`.

source: `qteasy`的K线图函数`candle`支持通过六位数股票/指数代码查询准确的证券代码，也支持通过股票、指数名称显示K线图 `qt.candle()`支持功能如下：
es: La función de gráfico de K-line de `qteasy` `candle` admite la consulta de códigos de valores precisos a través de códigos de valores de seis dígitos / índices, y también admite la visualización de gráficos de K-line a través de nombres de valores / índices `qt.candle()` admite las siguientes funciones:
fr: La fonction K-line `candle` de `qteasy` prend en charge la recherche de codes de sécurité précis en utilisant des codes d'actions/indices à six chiffres, et prend également en charge l'affichage de graphiques K-line en utilisant des noms d'actions/indices. `qt.candle()` prend en charge les fonctions suivantes :

source: 显示股票、基金、期货的K线
es: Mostrar K-line de acciones, fondos, futuros
fr: Afficher les graphiques K-line des actions, des fonds et des contrats à terme

source: 显示复权价格
es: Mostrar precios ajustados
fr: Afficher les prix ajustés

source: 显示分钟、 周或月K线
es: Mostrar K-line de minutos, semanas o meses
fr: Afficher les graphiques K-line par minute, par semaine ou par mois

source: 显示不同移动均线以及MACD/KDJ等指标
es: Mostrar diferentes medias móviles y MACD/KDJ y otros indicadores
fr: Afficher différentes moyennes mobiles et indicateurs tels que MACD/KDJ

source: 详细的用法请参考文档，示例如下(请先使用`qt.refill_data_source()`下载相应的历史数据)：
es: Consulte la documentación para obtener información detallada, aquí hay un ejemplo (primero use `qt.refill_data_source()` para descargar los datos históricos correspondientes):
fr: Pour plus de détails, veuillez consulter la documentation, voici un exemple (veuillez d'abord télécharger les données historiques correspondantes avec `qt.refill_data_source()`) :

source: 生成的K线图可以是一个交互式动态K线图（请注意，K线图基于`matplotlib`绘制，在使用不同的终端时，显示功能有所区别，某些终端并不支持 动态图表，详情请参阅 [matplotlib文档](https://matplotlib.org/stable/users/explain/backends.html)
es: El gráfico de K-line generado puede ser un gráfico de K-line dinámico interactivo (tenga en cuenta que el gráfico de K-line se basa en `matplotlib`, y la función de visualización varía según el terminal utilizado, y algunos terminales no admiten gráficos dinámicos, consulte los detalles [documentación de matplotlib](https://matplotlib.org/stable/users/explain/backends.html)
fr: Le graphique K-line généré peut être un graphique K-line dynamique interactif (veuillez noter que le graphique K-line est dessiné en utilisant `matplotlib`, et les fonctionnalités d'affichage varient selon les terminaux utilisés, certains terminaux ne prennent pas en charge les graphiques dynamiques, veuillez vous référer à la [documentation matplotlib](https://matplotlib.org/stable/users/explain/backends.html)

source: 在使用动态K线图时，用户可以用鼠标和键盘控制K线图的显示范围：
es: Cuando se utiliza un gráfico de K-line dinámico, los usuarios pueden controlar el rango de visualización del gráfico de K-line con el mouse y el teclado:
fr: Lors de l'utilisation du graphique K-line dynamique, l'utilisateur peut contrôler la plage d'affichage du graphique K-line à l'aide de la souris et du clavier :

source: 鼠标在图表上左右拖动：可以移动K线图显示更早或更晚的K线
es: Arrastrar el ratón hacia la izquierda o hacia la derecha en el gráfico: puede mover el gráfico de K-line para mostrar K-line más tempranos o más tardíos
fr: Faites glisser la souris vers la gauche ou la droite sur le graphique : pour déplacer le graphique K-line pour afficher des K-line plus anciens ou plus récents

source: 鼠标滚轮在图表上滚动，可以缩小或放大K线图的显示范围
es: Desplazar la rueda del ratón en el gráfico: puede acercar o alejar el gráfico de K-line
fr: Faites défiler la souris sur le graphique : pour zoomer ou dézoomer le graphique K-line

source: 通过键盘左右方向键，可以移动K线图的显示范围显示更早或更晚的K线
es: Puede mover el rango de visualización del gráfico de K-line hacia la izquierda o hacia la derecha para mostrar K-line más tempranos o más tardíos con las teclas de flecha izquierda y derecha del teclado
fr: Utilisez les touches fléchées gauche et droite du clavier : pour déplacer la plage d'affichage du graphique K-line pour afficher des K-line plus anciens ou plus récents

source: 通过键盘上下键，可以缩小或放大K线图的显示范围
es: Puede acercar o alejar el rango de visualización del gráfico de K-line con las teclas de flecha arriba y abajo del teclado
fr: Utilisez les touches fléchées haut et

source: 在K线图上双击鼠标，可以切换不同的均线类型
es: Doble clic en el gráfico de K-line para cambiar el tipo de media móvil
fr: Double-cliquez sur le graphique K-line

source: 在K线图的指标区域双击，可以切换不同的指标类型：`MACD`，`RSI`，`DEMA`
es: Doble clic en el área de indicadores del gráfico de K-line para cambiar el tipo de indicador: `MACD`, `RSI`, `DEMA`
fr: Double-cliquez sur la zone d'indicateur du graphique K-line pour

source: 关于`DataSource`对象的更多详细介绍，请参见[qteasy教程](https://github.com/shepherdpp/qteasy/tutorials)
es: Para obtener más información sobre el objeto `DataSource`, consulte [qteasy Tutorial](tutorials/1-get-started.md)
fr: Pour plus de détails sur l'objet `DataSource`, veuillez consulter [qteasy教程](

source: 创建一个投资策略
es: Crear una estrategia de inversión
fr: Créer une stratégie d'investissement

source: `qteasy`中的所有交易策略都是由`qteasy.Operator`（交易员）对象来实现回测和运行的，`Operator`对象是一个策略容器，一个交易员可以同时 管理多个不同的交易策略。
es: En `qteasy`, todas las estrategias de trading se implementan mediante el objeto `qteasy.Operator` (operador), el objeto `Operator` es un contenedor de estrategias, un operador puede administrar múltiples estrategias de trading diferentes al mismo tiempo.
fr: Toutes les stratégies de trading dans `qteasy` sont implémentées par l'objet `qteasy.Operator` (trader), l'objet `Operator` est un conteneur de stratégie, un trader peut gérer simultanément plusieurs stratégies de trading différentes.

source: `qteasy`提供了两种方式创建交易策略，详细的说明请参见使用教程：
es: `qteasy` proporciona dos formas de crear estrategias de trading, consulte el tutorial de uso para obtener más información:
fr: `qteasy` propose deux façons de créer des stratégies de trading, veuillez consulter le tutoriel d'utilisation pour plus de détails :

source: **使用内置交易策略组合**
es: **Usar combinaciones de estrategias de trading integradas**
fr: **Utiliser une combinaison de stratégies de trading intégrées**

source: **通过策略类自行创建策略**
es: **Crear estrategias por sí mismo a través de la clase de estrategia**
fr: **Créer des stratégies en utilisant des classes de stratégie personnalisées**

source: 生成一个DMA均线择时交易策略
es: Generar una estrategia de trading de tiempo de selección de media móvil DMA
fr: Créer une stratégie de trading de sélection de temps de moyenne mobile DMA

source: 在这里，我们将使用一个内置的`DMA`均线择时策略来生成一个最简单的大盘择时交易系统。所有内置交易策略的清单和详细说明请参见文档。
es: Aquí, usaremos una estrategia de tiempo de selección de media móvil `DMA` integrada para generar un sistema de trading de tiempo de selección de mercado más simple. Consulte la documentación para obtener una lista y descripción detallada de todas las estrategias de trading integradas.
fr: Ici, nous utiliserons une stratégie de sélection de temps de moyenne mobile `DMA` intégrée pour créer un système de trading de sélection de temps de marché le plus simple. Pour une liste complète des stratégies de trading intégrées et des explications détaillées, veuillez consulter la documentation.

source: 创建`Operator`对象时传入参数：`strategies='DMA'`，可以新建一个`DMA`双均线择时交易策略。 创建好`Operator`对象后，可以用`op.info()`来查看它的信息。
es: Cuando se crea el objeto `Operator` con el parámetro `strategies='DMA'`, se puede crear una nueva estrategia de trading de tiempo de selección de media móvil `DMA`. Después de crear el objeto `Operator`, puede usar `op.info()` para ver su información.
fr: Lors de la création de l'objet `Operator`, passez les paramètres : `strategies='DMA'`, pour créer une nouvelle stratégie de trading de sélection de temps de moyenne mobile `DMA`. Une fois l'objet `Operator` créé, vous pouvez utiliser `op.info()` pour afficher ses informations.

source: 现在可以看到`op`中有一个交易策略，ID是`dma`，我们在`Operator`层面设置或修改策略的参数 时，都需要引用这个`ID`。
es: Ahora puede ver que hay una estrategia de trading en `op`, el ID es `dma`, cuando configuramos o modificamos los parámetros de la estrategia en el nivel de `Operator`, necesitamos hacer referencia a este `ID`.
fr: Vous pouvez maintenant voir qu'il y a une stratégie de trading dans `op`, l'ID est `dma`, lorsque vous définissez ou modifiez les paramètres de la stratégie au niveau de l'objet `Operator`, vous devez faire référence à cet `ID`.

source: `DMA`是一个内置的均线择时策略，它通过计算股票每日收盘价的快、慢两根移动均线的差值`DMA`与其移动平均值`AMA`之间的交叉情况来确定多空或买卖点。：
es: `DMA` es una estrategia de tiempo de selección de media móvil integrada, que determina los puntos largos o cortos o de compra y venta según la intersección de la diferencia entre las dos medias móviles rápidas y lentas de los precios de cierre diarios de las acciones `DMA` y su valor promedio móvil `AMA`.：
fr: `DMA` est une stratégie de sélection de temps de moyenne mobile intégrée, elle détermine les points longs ou courts ou d'achat et de vente en calculant la différence entre les deux moyennes mobiles rapides et lentes du prix de clôture quotidien des actions `DMA` et en croisant la moyenne mobile `AMA` :

source: 使用`qt.built_ins()`函数可以查看`DMA`策略的详细解，使用`qt.built_ins()`函数可以获取或者筛选需要的内置交易策略，例如：
es: Puede ver la descripción detallada de la estrategia `DMA` con la función `qt.built_ins()`, y puede obtener o filtrar las estrategias de trading integradas necesarias con la función `qt.built_ins()`, por ejemplo:
fr: Vous pouvez utiliser la fonction `qt.built_ins()` pour afficher les détails de la stratégie `DMA`, et vous pouvez utiliser la fonction `qt.built_ins()` pour obtenir ou filtrer les stratégies de trading intégrées dont vous avez besoin, par exemple :

source: 得到：
es: Obtener:
fr: Résultat :

source: 在默认情况下，策略由三个**可调参数**：`(12,26,9)`, 但我们可以给出任意大于2小于250的三个整数作为策略的参数，以适应不同交易活跃度的股票、或者适应 不同的策略运行周期。
es: De forma predeterminada, la estrategia tiene tres **parámetros ajustables**: `(12,26,9)`, pero podemos proporcionar cualquier tres enteros mayores que 2 y menores que 250 como parámetros de la estrategia para adaptarse a acciones con diferentes niveles de actividad de trading, o para adaptarse a diferentes períodos de ejecución de la estrategia.
fr: Par défaut, la stratégie a trois **paramètres ajustables** : `(12,26,9)`, mais vous pouvez fournir trois entiers arbitraires supérieurs à 2 et inférieurs à 250 en tant que paramètres de stratégie, pour s'adapter à des actions de différentes activités de trading, ou pour s'adapter à différents cycles de trading.

source: 回测并评价交易策略的性能表现
es: Backtesting y evaluación del rendimiento de la estrategia de trading
fr: Backtest et évaluation des performances de la stratégie de trading

source: `qteasy`可以使用历史数据回测策略表现并输出图表如下：
es: `qteasy` puede usar datos históricos para backtesting y evaluar el rendimiento de la estrategia de trading y generar gráficos como se muestra a continuación:
fr: `qteasy` peut utiliser des données historiques pour backtester les performances de la stratégie de trading et afficher les graphiques comme suit :

source: 使用默认参数回测刚才建立的DMA策略在历史数据上的表现，可以使用`op.run(mode=1)`。
es: Para backtest el rendimiento de la estrategia DMA recién creada en los datos históricos con los parámetros predeterminados, puede usar `op.run(mode=1)`.
fr: Vous pouvez utiliser `op.run(mode=1)` pour backtester les performances de la stratégie DMA que vous venez de créer avec les paramètres par défaut sur les données historiques.

source: 输出结果如下：
es: Los resultados de salida son los siguientes:
fr: Les résultats de sortie sont les suivants :

source: 交易策略的参数调优
es: Optimización de parámetros de la estrategia de trading
fr: Optimisation des paramètres de la stratégie de trading

source: 交易策略的表现与参数有关，如果输入不同的参数，策略回报相差会非常大。`qteasy`可以用多种不同的优化算法，帮助搜索最优的策略参数，
es: El rendimiento de la estrategia de trading está relacionado con los parámetros. Si se ingresan diferentes parámetros, la diferencia en el rendimiento de la estrategia será muy grande. `qteasy` puede utilizar varios algoritmos de optimización diferentes para ayudar a buscar los mejores parámetros de la estrategia,
fr: Les performances de la stratégie de trading dépendent des paramètres, si vous entrez des paramètres différents, les rendements de la stratégie peuvent varier considérablement. `qteasy` peut utiliser plusieurs algorithmes d'optimisation différents pour rechercher les meilleurs paramètres de stratégie,

source: 要使用策略优化功能，需要设置交易策略的优化标记`opt_tag=1`，并配置环境变量`mode=2`即可:
es: Para utilizar la función de optimización de la estrategia, debe configurar la marca de optimización de la estrategia de trading `opt_tag=1` y configurar la variable de entorno `mode=2`.
fr: Pour utiliser la fonction d'optimisation de la stratégie, vous devez définir le drapeau d'optimisation de la stratégie de trading `opt_tag=1`, et configurer la variable d'environnement `mode=2` :
