Repository: 18773262/qteasy
Catalog: docs/source/locale/*/LC_MESSAGES/help.po
Languages: de

source: 需要帮助？
de: Brauchen Sie Hilfe?

source: 如果您在使用`qteasy`的过程中有任何问题或需要任何帮助，请随时联系我们，我们会尽力帮助您。
de: Wenn Sie Fragen haben oder Hilfe mit `qteasy` benötigen, kontaktieren Sie uns bitte und wir werden unser Bestes tun, um Ihnen zu helfen.

source: 报告bug或者功能请求
de: Einen Fehler oder eine Funktionsanfrage melden

source: 目前`qteays`正处于密集开发测试阶段，软件中不免存在一些漏洞和bug，如果大家使用中出现问题，欢迎[Issue-报告bug](https://github.com/shepherdpp/qteasy/issues/new?assignees=&labels=&projects=&template=bug-report---bug报告.md&title=)或者[提交新功能需求](https://github.com/shepherdpp/qteasy/issues/new?assignees=&labels=&projects=&template=feature-request---新功能需求.md&title=)给我，
de: Derzeit befindet sich `qteays` in der intensiven Entwicklungs- und Testphase, es gibt einige Lücken und Fehler in der Software, wenn Sie Probleme bei der Benutzung haben, können Sie sich gerne an [Issue-report-bug](https://github.com/shepherdpp/qteasy/issues/new?assignees=& labels=&projects=&template=bug-report---bug-report.md&title=) oder [Submit new feature request](https://github.com/shepherdpp/qteasy/issues/new?assignees=& labels=&projects=&template=feature-request---new-feature-request.md&title=) an mich.

source: 在提交功能请求以前，请先访问我们的 [开发路线图](https://qteasy.readthedocs.io/zh/latest/roadmap.html) 查阅你的功能请求是否已经在开发中。
de: Bevor Sie eine Funktionsanfrage einreichen, besuchen Sie bitte unsere [Development Roadmap] (https://qteasy.readthedocs.io/zh/latest/roadmap.html), um zu prüfen, ob Ihre Funktionsanfrage bereits in der Entwicklung ist.

source: 使用`qteasy`中遇到问题
de: Probleme mit `qteasy`

source: 如果你在使用`qteasy`中遇到问题，可以进入`qteasy`的[讨论区](https://github.com/shepherdpp/qteasy/discussions)提交问题参与讨论。
de: Wenn Sie Probleme mit `qteasy` haben, können Sie im [Diskussionsforum] von `qteasy` (https://github.com/shepherdpp/qteasy/discussions) eine Frage stellen und an der Diskussion teilnehmen.

source: 贡献代码
de: Code beisteuern

source: 如果你对`qteasy`感兴趣，欢迎参与`qteasy`的开发，欢迎提交Pull Request，在参与之前，请先阅读CONTRIBUTING文档。
de: Wenn Sie an `qteasy` interessiert sind, können Sie sich gerne an der Entwicklung von `qteasy` beteiligen, Sie können gerne Pull Requests einreichen, bitte lesen Sie die CONTRIBUTING Dokumentation bevor Sie sich beteiligen.

source: 联系我们
de: Kontakt

source: WeChat: shepherdpp
de: WeChat: schafhirtepp
