Repository: 18773262/qteasy
Catalog: docs/source/locale/*/LC_MESSAGES/index.po
Languages: de, es, fr

source: ``qteasy`` 快速入门
de: ``QTEASY`` Schnellstart
es: Guía de inicio rápido de ``QTEASY``
fr: Démarrage rapide de ``QTEASY``

source: ``qteasy`` 使用教程
de: ``QTEASY`` Lernprogramm
es: Tutorial de ``QTEASY``
fr: Tutoriel ``QTEASY``

source: 下载并管理金融历史数据
de: Herunterladen und Verwalten historischer Finanzdaten
es: Descargar y gestionar datos históricos financieros
fr: Téléchargez et gérez les données historiques financières

source: 创建交易策略
de: Handelsstrategie erstellen
es: Crear una estrategia comercial
fr: Créer une stratégie de trading

source: 回测并评价交易策略
de: Backtest und Evaluierung der Handelsstrategie
es: Realizar pruebas retrospectivas y evaluar la estrategia comercial
fr: Backtest and evaluate trading strategy

source: 优化交易策略
de: Handelsstrategie optimieren
es: Optimizar la estrategia comercial
fr: Optimiser la stratégie de trading

source: 模拟实盘运行交易策略
de: Simulieren Sie eine Echtzeit-Handelsstrategie
es: Simular una estrategia comercial en tiempo real
fr: Simulez une stratégie de trading en temps réel

source: 自定义策略示例
de: Beispiel für eine benutzerdefinierte Strategie
es: Ejemplo de estrategia personalizada
fr: Exemple de stratégie personnalisée

source: API参考
de: API-Referenz
es: Referencia API
fr: Référence API

source: LICENSE
de: LIZENZ
es: LICENCIA
fr: LICENCE

source: 关于 ``qteasy``
de: Über ``QTEASY``
es: Acerca de ``QTEASY``
fr: À propos de ``QTEASY``

source: 常见问题
de: Häufig gestellte Fragen
es: Preguntas frecuentes
fr: FAQ

source: 欢迎使用 ``QTEASY`` 文档!
de: Willkommen bei der ``QTEASY``-Dokumentation!
es: ¡Bienvenido a la documentación de ``QTEASY``!
fr: Bienvenue dans la documentation ``QTEASY`` !

source: 目前 ``qteays`` 正处于密集开发测试阶段，软件中不免存在一些漏洞和bug，如果大家使用中出现问题，欢迎 `报告Issue`_ 或者提交 `新功能需求`_ 给我，也可以进入 `讨论区`_ 参与讨论。欢迎各位贡献代码！
es: Actualmente, ``qteasy`` se encuentra en una etapa intensiva de desarrollo y prueba, y es inevitable que existan algunas vulnerabilidades y errores en el softwareSi encuentra problemas durante el uso, puede ``Informar un problema`` o enviarme ``Nueva solicitud de función``. También puede ingresar al ``Área de discusión`` para participar en la discusión. ¡Agradecemos mucho sus contribuciones!

source: 作者: **Jackie PENG**
de: Autor: **Jackie PENG**
es: Autor: **Jackie PENG**
fr: Auteur : **Jackie PENG**

source: email: *jackie_pengzhao@163.com*
es: Correo electrónico: *jackie_pengzhao@163.com*
fr: Courriel : *jackie_pengzhao@163.com*

source: 创建日期: 2019, July, 16
de: Erstellt: 16. Juli 2019
es: Creado: 16 de julio de 2019
fr: Créé le 16 juillet 2019

source: 最新版本: `1.4.8`
de: Neueste Version: `1.4.8`
es: Última versión: `1.4.8`

source: License: BSD 3-Clause
de: Lizenz: BSD 3-Klausel
es: Licencia: BSD 3 cláusulas
fr: Licence : BSD 3-Clause

source: 简介
de: Kurze Einleitung
es: Breve introducción
fr: Brève introduction

source: ``QTEASY`` 是为量化交易人员开发的一套量化交易策略开发工具包，基本功能如下：
de: ``QTEASY`` ist ein Satz von Toolkits zur Entwicklung quantitativer Handelsstrategien, die für quantitatives Handelspersonal entwickelt wurden und die folgenden Grundfunktionen aufweisen:
es: ``QTEASY`` es un conjunto de herramientas de desarrollo de estrategias comerciales cuantitativas desarrollado para personal de comercio cuantitativo, con las siguientes funciones básicas:
fr: ``QTEASY`` est un ensemble de boîtes à outils de trading quantitatif développées pour le personnel de trading quantitatif, avec les fonctions de base suivantes :

source: 金融历史数据的获取、清洗、整理、可视化、本地存储查询及应用；支持多种数据存储方式，包括本地文件、MySQL数据库等，数据来源包括 ``Tushare`` 、 ``EastMoney`` 等
de: Erfassung, Bereinigung, Sortierung und Visualisierung historischer Finanzdaten, Abfrage und Anwendung des lokalen Speichers; Unterstützung mehrerer Datenspeichermethoden, einschließlich lokaler Dateien, MySQL-Datenbanken usw., Datenquellen umfassen ``Tushare``, ``EastMoney`` usw.
es: Adquisición, limpieza, clasificación, visualización, consulta y aplicación de datos históricos financieros; admite múltiples métodos de almacenamiento de datos, incluidos archivos locales, bases de datos MySQL, etc., las fuentes de datos incluyen ``Tushare``, ``EastMoney``, etc.
fr: Acquisition, nettoyage, tri, visualisation, requête de stockage local et application de données historiques financières ; prend en charge plusieurs méthodes de stockage de données, y compris les fichiers locaux, les bases de données MySQL, etc., les sources de données incluent ``Tushare``, ``EastMoney``, etc.

source: 投资交易策略的创建、回测、性能评价，并且通过定义策略的可调参数，提供多种优化算法实现交易策略的参数调优
de: Erstellung von Investment-Trading-Strategien, Backtests, Leistungsbewertung und Bereitstellung mehrerer Optimierungsalgorithmen zur Parameteroptimierung von Trading-Strategien durch Definition der anpassbaren Parameter der Strategie
es: Creación de estrategias de negociación de inversiones, pruebas retrospectivas, evaluación del rendimiento y provisión de múltiples algoritmos de optimización para lograr la optimización de parámetros de las estrategias de negociación mediante la definición de los parámetros ajustables de la estrategia
fr: Création de stratégies de trading d'investissement, backtesting, évaluation des performances et fourniture de plusieurs algorithmes d'optimisation pour obtenir l'optimisation des paramètres des stratégies de trading en définissant les paramètres ajustables de la stratégie

source: 交易策略的部署、实盘运行、模拟交易结果、并跟踪记录交易日志、股票持仓、账户资金变化等信息
de: Bereitstellung von Handelsstrategien, Echtzeitbetrieb, Simulation von Handelsergebnissen sowie Verfolgung und Aufzeichnung von Handelsprotokollen, Aktienpositionen, Änderungen des Kontoguthabens usw.
es: Implementación de estrategia comercial, operación en tiempo real, simulación de resultados comerciales y seguimiento y registro de registros comerciales, posiciones de acciones, cambios en los fondos de la cuenta, etc.
fr: Déploiement de stratégie de trading, fonctionnement en temps réel, simulation des résultats de trading, suivi et enregistrement des journaux de trading, des positions boursières, des variations des fonds du compte, etc.

source: ``QTEASY`` 能做什么?
de: Wofür ist ``QTEASY`` gedacht?
es: ¿Para qué está diseñado ``QTEASY``?
fr: À quoi sert ``QTEASY`` ?

source: 获取并管理金融历史数据
de: Erfassung und Verwaltung historischer Finanzdaten
es: Adquirir y gestionar datos históricos financieros
fr: Acquérir et gérer des données financières historiques

source: 获取、清洗、本地存储大量金融历史数据
de: Erfassen, bereinigen und lokal speichern Sie eine große Menge historischer Finanzdaten.
es: Adquirir, limpiar y almacenar localmente una gran cantidad de datos históricos financieros
fr: Acquérir, nettoyer et stocker localement une grande quantité de données historiques financières

source: 检索、处理、调用本地数据
de: Lokale Daten suchen, extrahieren und verarbeiten
es: Buscar, procesar y llamar datos locales
fr: Rechercher, traiter et appeler des données locales

source: 本地金融数据可视化
de: Lokale Finanzdaten visualisieren
es: Visualizar datos financieros locales
fr: Visualiser les données financières locales

source: 创建交易策略，模拟自动化交易
de: Handelsstrategie erstellen, automatisierten Handel simulieren
es: Crear una estrategia comercial, simular el comercio automatizado
fr: Créez une stratégie de trading, simulez un trading automatisé

source: 快速搭建交易策略，使用超过70中内置交易策略或自行创建交易策略
de: Erstellen Sie schnell eine Handelsstrategie, verwenden Sie mehr als 70 integrierte Handelsstrategien oder erstellen Sie selbst eine Handelsstrategie
es: Cree una estrategia comercial rápidamente, utilice más de 70 estrategias comerciales integradas o cree una estrategia comercial usted mismo
fr: Créez rapidement une stratégie de trading, utilisez plus de 70 stratégies de trading intégrées ou créez vous-même une stratégie de trading

source: 获取实时市场数据，运行策略模拟自动化交易
de: Erwerben Sie Marktdaten in Echtzeit, führen Sie Strategiesimulationen durch und betreiben Sie automatisierten Handel
es: Adquiera datos del mercado en tiempo real y ejecute operaciones automatizadas con simulación de estrategias
fr: Acquérir des données de marché en temps réel, exécuter une simulation de stratégie de trading automatisé

source: 跟踪记录交易日志、股票持仓、账户资金变化等信息
de: Verfolgen und Aufzeichnen von Handelsprotokollen, Aktienpositionen, Änderungen des Kontoguthabens usw.
es: Realice un seguimiento y registre registros de operaciones, posiciones de acciones, cambios en los fondos de la cuenta, etc.
fr: Suivez et enregistrez les journaux de transactions, les positions boursières, les modifications des fonds du compte, etc.

source: 通过多种用户界面查看并控制交易程序
de: Überwachen und steuern Sie Handelsprogramme über mehrere Benutzeroberflächen
es: Supervise y controle los programas comerciales a través de múltiples interfaces de usuario
fr: Surveillez et contrôlez les programmes de trading via plusieurs interfaces utilisateur

source: 未来将通过QMT接口接入券商提供的实盘交易接口，实现自动化交易
de: In Zukunft wird ``qteasy`` über QMT auf Handelsmakler zugreifen können, um automatisierten Handel zu realisieren
es: En el futuro, ``qteasy`` podrá realizar operaciones automáticas en vivo conectándose a las API de operaciones proporcionadas por corredores, como QMT.
fr: À l'avenir, ``qteasy`` pourra réaliser des transactions automatiques en direct en se connectant aux API de trading fournies par les courtiers, tels que QMT

source: 回测、评价、优化交易策略
de: Backtests, Evaluierungen und Optimierungen bei Handelsstrategien
es: Realizar pruebas retrospectivas, evaluar y optimizar las estrategias comerciales
fr: Backtest, évaluation et optimisation des stratégies de trading

source: 使用历史数据回测交易策略，生成完整的历史交易清单，生成交易结果
de: Führen Sie Backtests für Handelsstrategien anhand historischer Daten durch, erstellen Sie eine vollständige Liste historischer Handelsgeschäfte und generieren Sie Handelsergebnisse
es: Pruebe estrategias comerciales retrospectivamente utilizando datos históricos, genere registros comerciales completos y genere resultados comerciales
fr: Testez les stratégies de trading à l'aide de données historiques, générez des enregistrements de trading complets et des résultats

source: 对交易结果进行多维度全方位评价，生成交易报告和结果图标
de: Bewerten Sie die Handelsergebnisse aus mehreren Dimensionen, erstellen Sie Handelsberichte und Ergebnisdiagramme
es: Evalúe los resultados comerciales desde múltiples dimensiones, genere informes comerciales y gráficos de resultados
fr: Évaluez les résultats commerciaux à partir de plusieurs dimensions, générez des rapports commerciaux et des graphiques de résultats

source: 提供多种优化算法，帮助搜索最优的策略参数，提高策略表现
de: Optimieren Sie die Strategieparameter mit mehreren Optimierungsalgorithmen, um die Strategieleistung zu verbessern
es: Optimice los parámetros de la estrategia con múltiples algoritmos de optimización.
fr: Optimisez les paramètres de la stratégie avec plusieurs algorithmes d'optimisation.

source: 目前 ``QTEASY`` 正处于密集开发测试阶段，软件中不免存在一些漏洞和bug，如果大家使用中出现问题，欢迎 `报告Issue`_ 或者提交 `新功能需求`_ 给我，也可以进入 `讨论区`_ 参与讨论。欢迎各位贡献代码！
fr: Actuellement, ``qteasy`` est en cours de développement intensif, il peut donc y avoir des bugs dans le logiciel. Si vous rencontrez un problème, veuillez `Signaler un problème`_ ou soumettre `Demande de nouvelle fonctionnalité`_, vous pouvez également utiliser `Discussion`_ pour partager votre idée avec nous. Les contributions sont très appréciées !

source: 最新版本: `1.4.9`
fr: Dernière version: ``1.4.9``

source: 目前 ``qteasy`` 正处于密集开发测试阶段，软件中不免存在一些漏洞和bug，如果大家使用中出现问题，欢迎 `报告Issue`_ 或者提交 `新功能需求`_ 给我，也可以进入 `讨论区`_ 参与讨论。欢迎各位贡献代码！
de: Derzeit befindet sich ``qteasy`` in der intensiven Entwicklungs- und Testphase und die Software weist zwangsläufig einige Schwachstellen und Fehler auf. Wenn Sie während der Verwendung auf Probleme stoßen, können Sie mir gerne ein ``Problem melden`` oder eine ``Anforderung für eine neue Funktion`` senden. Sie können auch den ``Diskussionsbereich`` aufrufen, um an der Diskussion teilzunehmen. Beiträge werden sehr geschätzt!
