Repository: 18773262/qteasy
Catalog: docs/source/locale/*/LC_MESSAGES/tutorials/1-get-started.po
Languages: de

# 在每个历史分段中，按照指定的比例（p<1时）随机抽取若干股票，或随机抽取指定数量（p>=1）的股票进入投资组合，投资比例平均分配
source: In each historical segment, randomly select a certain number of stocks according to the specified proportion (p<1), or randomly select a specified number of stocks (p>=1) to enter the investment portfolio, and the investment ratio is evenly distributed
de: In jedem historischen Segment wird eine Anzahl von Aktien in einem bestimmten Verhältnis zufällig ausgewählt (wenn p<1) oder eine bestimmte Anzahl von Aktien zufällig (p>=1) in das Portfolio aufgenommen, wobei der Anteil der Investitionen gleichmäßig verteilt ist

source: finance
de: Finanzen

source: SelectingAvgIndicator
de: Auswahl eines Durchschnittsindikators

source: Invest in stocks based on the average value of financial indicators of stocks over a period of time. Basic stock selection strategy: use the average value of historical indicators of stocks as the stock selection factor. The factor sorting parameters can be passed in as strategy parameters to change the strategy data type, select stocks based on different historical data, and select stock parameters can be passed in through pars
de: Aktienauswahl auf der Grundlage des Durchschnitts der Finanzindikatoren einer Aktie über einen bestimmten Zeitraum als Aktienauswahlfaktor, grundlegende Aktienauswahlstrategie: der Durchschnitt der historischen Indikatoren einer Aktie als Aktienauswahlfaktor, der Faktor Sortierung Parameter kann in als Strategie-Parameter übergeben werden, ändern Sie die Strategie Datentyp, Aktienauswahl auf der Grundlage verschiedener historischer Daten, Aktienauswahl Parameter kann durch pars übergeben werden

source: `SelectingNDayLast`
de: Auswahl des letzten Tages".

# 以股票N天前的价格或数据指标作为选股因子选股
source: Select stocks based on the price or data indicators of stocks N days ago
de: Aktienauswahl unter Verwendung des N-Tage-voraus-Kurses oder von Datenindikatoren als Aktienauswahlfaktoren

source: SelectingNDayAvg
de: AuswahlNDayAvg

# 以股票过去N天的价格或数据指标的平均值作为选股因子选股
source: Select stocks based on the average value of the price or data indicators of stocks over the past N days
de: Aktienauswahl unter Verwendung des Durchschnitts des Kurses oder des Datenindikators einer Aktie in den letzten N Tagen als Aktienauswahlfaktor

source: SelectingNDayRateChange
de: Auswahl von "DayRateChange

# 以股票过去N天的价格或数据指标的变动比例作为选股因子选股
source: Select stocks based on the change rate of the price or data indicators of stocks over the past N days
de: Aktienauswahl anhand der prozentualen Veränderung des Kurses oder des Datenindikators einer Aktie in den letzten N Tagen als Aktienauswahlfaktor

# 以股票过去N天的价格或数据指标的变动值作为选股因子选股
source: S
de: Aktienauswahl durch Verwendung des Wertes der Kurs- oder Datenindikatoränderungen der letzten N Tage als Aktienauswahlfaktor

source: SelectingNDayVolatility
de: AuswählenderTagVolatilität

# 根据股票以前N天的股价波动率作为选股因子
source: Based on the stock price volatility of the stock in the previous N days as the stock selection factor
de: Aktienauswahlfaktor auf der Grundlage der Kursvolatilität der Aktie in den letzten N Tagen

# 下面简单介绍`TA-lib`的安装方法：
source: Next, a brief introduction to the installation method of `TA-lib`
de: Im Folgenden wird kurz beschrieben, wie man die `TA-lib` installiert:

source: Complete `TA-Lib` package cannot be installed via pip, because what is installed by `pip install ta-lib` is only a `python
de: Das komplette `TA-Lib`-Paket kann nicht über pip installiert werden, weil `pip install ta-lib` nur einen `python wrapper` für das TA-Lib-Paket installiert, und der Benutzer muss zuerst TA-Lib für C installieren, bevor er es in Python benutzen kann.

# 有些用户可以用下面的方法安装C语言的TA-Lib包： `conda install -c conda-forge libta-lib`
source: Some users can install the C language TA-Lib package using the following method: `conda install -c conda-forge libta-lib`
de: Einige Benutzer können das TA-Lib-Paket für C mit der folgenden Methode installieren: `conda install -c conda-forge libta-lib`

# 在不同的系统下安装C语言的TA-Lib包的方法：
source: Installation method of C language TA-Lib package on different systems:
de: Die Methode zur Installation von TA-Lib-Paketen für C auf verschiedenen Systemen:

source: Windows
de: Windows (Computer)

source: Download [ta-lib-0.4.0-msvc.zip](http://prdownloads.sourceforge.net/ta-lib/ta-lib-0.4.0-msvc.zip) and unzip to `C:\ta-lib`.
de: Laden Sie [ta-lib-0.4.0-msvc.zip] (http://prdownloads.sourceforge.net/ta-lib/ta-lib-0.4.0-msvc.zip) herunter und entpacken Sie es nach `C:\ta-lib`.

# 下载并安装 `Visual Studio Community` (2015 或更新版本)， 选择 `[Visual C++]` 功能
source: Download and install `Visual Studio Community` (2015 or later version), select `[Visual C++]` function
de: Laden Sie `Visual Studio Community` (2015 oder höher) herunter und installieren Sie es, wählen Sie die Funktion `[Visual C++]`.

# Windows 开始菜单, 启动 `[VS2015 x64 Native Tools Command Prompt]`
source: Windows Start menu, start `[VS2015 x64 Native Tools Command Prompt]`
de: Windows-Startmenü, starten Sie `[VS2015 x64 Native Tools Eingabeaufforderung]`

# 移动至 `C:\ta-lib\c\make\cdr\win32\msvc`
source: Move to `C:\ta-lib\c\make\cdr\win32\msvc`
de: Nach "C:\ta-lib\c\make\cdr\win32\msvc" verschieben.

# 如果使用Apple Silicon芯片，可以使用：
source: If you are using an Apple Silicon chip, you can use:
de: Apple Silicon Chips können verwendet werden, wenn sie verwendet werden:

source: Download [ta-lib-0.4.0-src.tar.gz](http://prdownloads.sourceforge.net/ta-lib
de: Laden Sie [ta-lib-0.4.0-src.tar.gz](http://prdownloads.sourceforge.net/ta-lib/ta-lib-0.4.0-src.tar.gz) herunter und.

# 安装完成C语言`TA-Lib`后，可以安装`TA-Lib`的`python wrapper`：
source: Install the `python wrapper` of `TA-Lib` after installing the C language `TA-Lib`
de: Nach der Installation von `TA-Lib` für C, können Sie `python wrapper` für `TA-Lib` installieren:

# 更完整的`TA-Lib`的安装方法请参考[这里](https://pypi.org/prject/TA-Lib/)
source: More complete installation method of `TA-Lib`, please refer to [here](https://pypi.org/prject/TA-Lib/)
de: Für eine vollständige Installation der `TA-Lib` siehe [hier](https://pypi.org/prject/TA-Lib/)

# 初始化`QTEASY`
source: Initialize `QTEASY`
de: Initialisierung von `QTEASY`

# 当`qteasy`的所有依赖包正确安装后，就可以在IDE中导入`qteasy`了。
source: When all the dependent packages of `qteasy` are correctly installed, you can import `qteasy` in the IDE.
de: Sobald alle Abhängigkeiten von `qteasy` korrekt installiert sind, können Sie `qteasy` in der IDE importieren.

source: Importing `qteasy` for the first time will automatically initialize. The initialization process will create a `qteasy.cfg` file, which is used to store the environment configuration variables of qteasy. Users can modify this file to modify the environment configuration variables of `qteasy`.
de: Wenn `qteasy` zum ersten Mal importiert wird, wird es automatisch initialisiert, und während des Initialisierungsprozesses wird eine `qteasy.cfg`-Datei erstellt, die dazu dient, die Umgebungskonfigurationsvariablen von `qteasy` zu speichern, und Benutzer können `qteasy` durch Modifizierung dieser Datei verändern.

# 用户可以将一些关键配置信息存放在`qteasy.cfg`文件中，这样`qteasy`在导入时会自动读取这些配置信息。
source: Users can store some key configuration information in the `qteasy.cfg` file, so that `qteasy` will automatically read these configuration information when imported.
de: Benutzer können einige wichtige Konfigurationsinformationen in der Datei `qteasy.cfg` speichern, so dass `qteasy` diese Konfigurationsinformationen beim Importieren automatisch liest.

# 访问`QTEASY`初始配置文件的两种方法
source: Visit the two methods of the initial configuration file of `QTEASY`
de: Zwei Möglichkeiten, auf die `QTEASY`-Konfigurationsdatei zuzugreifen

# 为了方便用户编辑`qteasy`的初始配置文件，`qteasy`提供了两种方法：
source: For the convenience of users to edit the initial configuration file of `qteasy`, `qteasy` provides two methods:
de: Um es den Benutzern zu erleichtern, die anfängliche Konfigurationsdatei von `qteasy` zu bearbeiten, bietet `qteasy` zwei Methoden:

# 1，使用`qteasy.update_start_up_setting()`方法
source: 1. Use the `qteasy.update_start_up_setting()` method
de: 1, unter Verwendung der Methode `qteasy.update_start_up_setting()`

# `qteasy`提供了一系列的内置函数，方便用户在启动后显示和修改启动配置信息。
source: `qteasy` provides a series of built-in functions to facilitate users to display and modify startup configuration information after startup.
de: `qteasy` bietet eine Reihe von eingebauten Funktionen zum Anzeigen und Ändern von Boot-Konfigurationsinformationen nach dem Start.

# 要查看当前的启动配置，使用函数`qteasy.start_up_settings()`打印当前的启动配置信息：
source: To view the current startup configuration, use the function `qteasy.start_up_settings()` to print the current startup configuration information:
de: Um die aktuelle Startkonfiguration zu sehen, verwenden Sie die Funktion `qteasy.start_up_settings()`, um die aktuellen Startkonfigurationsinformationen zu drucken:

# 第一次启动`qteasy`时启动配置文件为空，此时打印出的信息为空。
source: Start the first time `qteasy` is started, the startup configuration file is empty, and the printed information is empty.
de: Wenn Sie `qteasy` zum ersten Mal starten, ist die Startkonfigurationsdatei leer, und die zu diesem Zeitpunkt ausgegebenen Informationen sind leer.

# 要修改或更新启动配置文件，直接调用函数`qteasy.update_start_up_setting(**kwargs)`,传入的参数将被写入启动配置文件：
source: To modify or update the startup configuration file, directly call the function `qteasy.update_start_up_setting(**kwargs)`, the parameters passed in will be written to the startup configuration file:
de: Um die Startkonfigurationsdatei zu ändern oder zu aktualisieren, rufen Sie die Funktion `qteasy.update_start_up_setting(**kwargs)` direkt auf, und die übergebenen Argumente werden in die Startkonfigurationsdatei geschrieben:

# 如果上述信息有错，可以随时修改，关闭IDE后重新`import qteasy`即可生效
source: If the above information is incorrect, you can modify it at any time, close the IDE and re-import `qteasy` to take effect
de: Wenn die obigen Informationen falsch sind, können Sie sie jederzeit ändern, die IDE schließen und `import qteasy` erneut ausführen, damit es funktioniert.

# 2，直接访问`qteasy.cfg`文件
source: 2. Directly access the `qteasy.cfg` file
de: 2, Direkter Zugriff auf die Datei `qteasy.cfg`.

# 用户可以在资源管理器、访达或者终端中找到`qteasy`的根目录，然后打开`qteasy.cfg`文件，修改其中的内容。
source: Users can find the root directory of `qteasy` in the file explorer, Finder, or terminal, and then open the `qteasy.cfg` file to modify its contents.
de: Benutzer können das Stammverzeichnis von `qteasy` im Explorer, Access oder Terminal finden und dann die Datei `qteasy.cfg` öffnen und ihren Inhalt ändern.

# 在qteasy中可以通过`qt.QT_ROOT_PATH`查看qteasy的根目录
source: In qteasy, you can view the root directory of qteasy through `qt.QT_ROOT_PATH`
de: Das Wurzelverzeichnis von qteasy kann in qteasy mit `qt.QT_ROOT_PATH' eingesehen werden

# 第一次初始化后的`qteasy.cfg`文件内容如下：
source: The content of the `qteasy.cfg` file after the first initialization is as follows:
de: Der Inhalt der Datei `qteasy.cfg` nach der ersten Initialisierung sieht folgendermaßen aus:

# 用户可以直接在文件中添加配置信息，保存文件后重新导入`qteasy`即可使配置生效了，例如：
source: Users can directly add configuration information in the file, save the file and re-import `qteasy` to make the configuration effective, for example:
de: Benutzer können Konfigurationsinformationen direkt in die Datei eingeben, die Datei speichern und `qteasy` erneut importieren, damit die Konfiguration wirksam wird:

# 以下几个配置信息是用户在使用`qteasy`前非常有必要配置的：
source: Following are several configuration information that users must configure before using `qteasy`
de: Die folgenden Konfigurationsinformationen sind für Benutzer sehr wichtig, bevor sie `qteasy` benutzen:

# 配置`tushare`的API token
source: Configure the API token of `tushare`
de: Konfigurieren des `tushare` API-Tokens

source: Note that `tushare` is a paid data service. Users need to obtain points. The more points they have, the more types of data they can obtain, and the greater the permissions. If you do not configure the `tushare token`, you will not be able to use the `tushare` data service normally.
de: Beachten Sie, dass `tushare` ein kostenpflichtiger Datendienst ist, für den die Nutzer Punkte erwerben müssen. Je mehr Punkte, desto mehr Datenarten und Berechtigungen sind zu erhalten, wenn Sie das `tushare-Token` nicht konfigurieren, können Sie den Datendienst `tushare` normalerweise nicht nutzen.

source: If you have created a `tushare` account and obtained a `token` according to the content of the previous section of the tutorial, you can write the token to the `qteasy.cfg` file, so that the `token` will be automatically read when importing `qteasy`.
de: Wenn Sie ein `tushare`-Konto erstellt und ein `Token` gemäß dem vorherigen Abschnitt des Tutorials erhalten haben, können Sie das Token in die Datei `qteasy.cfg` schreiben, so dass dieses `Token` beim Importieren von `qteasy` automatisch gelesen wird.

# 在`qteasy.cfg`文件中添加以下内容：
source: Add the following content to the `qteasy.cfg` file:
de: Fügen Sie der Datei `qteasy.cfg` Folgendes hinzu:

# 配置本地数据源
source: Configure local data source
de: Konfigurieren der lokalen Datenquelle

# 默认情况下，`qteasy`使用csv文件保存本地数据，速度较慢而且占用空间较大。为了更好地使用`qteasy`，用户还应该完成本地数据源的基本配置。
source: By default, `qteasy` uses csv files to save local data, which is slow and takes up a lot of space. In order to better use `qteasy`, users should also complete the basic configuration of the local data source.
de: Standardmäßig verwendet `qteasy` eine csv-Datei, um lokale Daten zu speichern, was langsam ist und viel Speicherplatz benötigt. Um `qteasy` besser nutzen zu können, sollten Benutzer auch die Grundkonfiguration der lokalen Datenquelle vornehmen.

source: If you have created a `mysql` database according to the content of the previous section of the tutorial, you can write the configuration information of the database to the `qteasy.cfg` file, so that `qteasy` will connect to the database you specified and store financial data in the database.
de: Wenn Sie eine `mysql`-Datenbank gemäß dem vorherigen Abschnitt des Tutorials erstellt haben, können Sie die Datenbankkonfigurationsinformationen in die Datei `qteasy.cfg` schreiben, so dass `qteasy` sich mit der von Ihnen angegebenen Datenbank verbindet und die Finanzdaten in der Datenbank speichert.

# 在`qteasy.cfg`文件中添加以下内容，
source: Add the following content to the `qteasy.cfg` file:
de: Fügen Sie der Datei `qteasy.cfg` Folgendes hinzu.

# 或者使用`qteasy.update_start_up_setting()`：
source: Or use `qteasy.update_start_up_setting()`：
de: Oder verwenden Sie `qteasy.update_start_up_setting()`:

# 如果不做上述配置，`qteasy`会使用默认的csv文件作为本地数据源。
source: If the above configuration is not done, `qteasy` will use the default csv file as the local data source.
de: Ohne die obige Konfiguration wird `qteasy` die Standard-csv-Datei als lokale Datenquelle verwenden.

# 请注意，在文件中给出配置信息的时候，请不要加`<`和`>`，否则，这些字符也会被认为是`token`或者数据库名的一部份。从而导致连接数据库失败。
source: Please note that when giving configuration information in the file, do not add `<` and `>`, otherwise, these characters will also be regarded as part of the `token` or database name. This will cause the database connection to fail.
de: Bitte beachten Sie, dass Sie bei der Angabe von Konfigurationsinformationen in der Datei keine `<` und `>` hinzufügen, da diese Zeichen sonst auch als Teil des `Token` oder des Datenbanknamens betrachtet werden. Dies führt dazu, dass die Verbindung zur Datenbank fehlschlägt.

# `qteasy`在解析配置文件的时候，会根据配置的类型，自动转换为正确的格式，例如，数据库端口`3306`应该是`int`变量，直接使用：
source: `qteasy` will automatically convert to the correct format according to the type of configuration when parsing the configuration file. For example, the database port `3306` should be an `int` variable. Direct use:
de: Wenn `qteasy` die Konfigurationsdatei parst, konvertiert es sie automatisch in das richtige Format, je nach Art der Konfiguration, z.B. sollte der Datenbankport `3306` eine `int`-Variable sein und direkt verwendet werden:

# 即可。`qteasy`会将字符串`3306`转换为`int`型`3306`。·
source: That's it. `qteasy` will convert the string `3306` to `int` type `3306`.
de: Kann gemacht werden. `qteasy` konvertiert den String `3306` in den `int` Typ `3306`. -

# 下面这个配置文件的例子是正确的：
source: The following example of the configuration file is correct:
de: Das folgende Beispiel für eine Konfigurationsdatei ist korrekt:

# 开始下载第一批金融数据
source: Start downloading the first batch of financial data
de: Starten Sie den Download des ersten Stapels von Finanzdaten

# 完成上述配置以后，保存并关闭`qteasy.cfg`文件，恭喜你，`qteasy`已经安装并配置好了，现在可以开始使用`qteasy`了。
source: Finish the above configuration, save and close the `qteasy.cfg` file, congratulations, `qteasy` has been installed and configured, now you can start using `qteasy`.
de: Nachdem Sie die obige Konfiguration abgeschlossen haben, speichern und schließen Sie die Datei `qteasy.cfg`, herzlichen Glückwunsch, `qteasy` ist installiert und konfiguriert, jetzt können Sie `qteasy` benutzen.

# 首先，我们需要下载一些金融数据，交易策略的回测、优化、评价等所有功能都需要用到金融数据。 在这里，我们可以先下载一些股票数据，以便后续的教程中使用。
source: First, we need to download some financial data. All functions such as backtesting, optimization, evaluation, etc. of trading strategies require financial data. Here, we can first download some stock data for use in subsequent tutorials.
de: Zunächst müssen wir einige Finanzdaten herunterladen, die für alle Funktionen des Backtestings, der Optimierung und der Bewertung von Handelsstrategien erforderlich sind. Hier können wir zunächst einige Aktiendaten für die Verwendung in den nachfolgenden Tutorials herunterladen.

source: `qt.refill_data_source` is a general data download function. By specifying the data table name, data acquisition channel (default `tushare`), start date/end date, and stock code, `qteasy` can connect to the corresponding network data provider and automatically download data in batches. When the amount of data downloaded is very large, this function will automatically handle data splitting. At the same time, this function will automatically handle the problem of data download failure caused by network latency, and provide a throttling option to prevent connection failure caused by excessive download traffic. The downloaded data will be automatically cleaned up and deduplicated to ensure that the data written to `DataSource` is clean. For more information about the `refill_data_source()` function, please refer to [api_reference](../api/api_reference.rst).
de: Durch Angabe des Datentabellennamens, des Datenerfassungskanals (standardmäßig `tushare`), des Start-/Enddatums und der Tickersymbole stellt `qteasy` eine Verbindung zum entsprechenden Netzwerkdatenanbieter her und lädt die Daten automatisch in Batches herunter. Die Funktion sorgt automatisch für eine Aufteilung der Daten, wenn die heruntergeladenen Daten sehr groß sind. Gleichzeitig kümmert sich die Funktion automatisch um Fehler beim Herunterladen von Daten, die durch Netzwerkverzögerungen verursacht werden, und bietet eine Option zur Begrenzung des Datenflusses, um Verbindungsabbrüche aufgrund von übermäßigem Datenverkehr zu verhindern. Die heruntergeladenen Daten werden automatisch bereinigt, geordnet und entdupliziert, um sicherzustellen, dass die in die Datenquelle geschriebenen Daten sauber sind. Für weitere Informationen über die Funktion `refill_data_source()` siehe [api_reference](... /api/api_reference.rst).

source: Through the `refill_data_source` function, you can download financial data such as stocks, futures, indexes, funds, etc., as well as non-trading data such as macroeconomics, financial statements, financial indicators, company basic information, etc. `qteasy` can batch download data to the local, and can also use multi-threaded parallel download, provide download progress bar, especially suitable for downloading a large amount of historical data to the local at one time, and also suitable for regular operation, regularly supplementing incremental data, such as monthly or weekly supplement download all data of this month or this week.
de: Mit der Funktion `refill_data_source` können Sie Finanzdaten wie Aktien, Futures, Indizes, Fonds usw. sowie Nicht-Transaktionsdaten wie Makroökonomie, Finanzberichte, Finanzindikatoren und grundlegende Unternehmensinformationen herunterladen. qteasy" kann Batch-Download von Daten auf lokaler Ebene, darüber hinaus können Sie auch Multi-Thread-parallelen Download, bieten Download-Fortschrittsbalken, besonders geeignet für die einmalige Download einer großen Anzahl von historischen Daten zu speichern, um die lokale, sondern auch geeignet für den regelmäßigen Betrieb, regelmäßig aufzufüllen inkrementelle Daten, wie monatliche oder wöchentliche Auffüllung der Download aller Daten des Monats oder der Woche.

source: Currently, data can be obtained from channels such as `tushare` / `akshare` / `eastmoney`, but `tushare` is the main channel for the time being. The `tushare` channel covers all data APIs, and the APIs of the other two channels will be gradually added with version updates.
de: Derzeit unterstützen wir den Datenabruf aus den Kanälen `tushare` / `akshare` / `eastmoney`, aber im Moment ist `tushare` der Hauptkanal, `tushare` deckt alle Daten-APIs ab, und die APIs der anderen beiden Kanäle werden nach und nach mit dem Versions-Update hinzugefügt.

source: In `qteasy`, all data is saved in a specific data table, and each type of data has a data ID, such as `pe` representing the price-earnings ratio, `open` representing the opening price, and so on; through the data ID, users can obtain the required data in `qteasy` at any time - as long as the data has been downloaded to the local.
de: In `qteasy` werden alle Daten in speziellen Datentabellen gespeichert, und jede Art von Daten hat eine Daten-ID, z.B. `pe` für das KGV, `open` für den Eröffnungskurs usw. Anhand der Daten-IDs kann der Benutzer jederzeit die von ihm benötigten Daten in `qteasy` abrufen - vorausgesetzt, die Daten wurden lokal heruntergeladen wurden.

source: At the same time, the data ID is also the core of the trading strategy in `qteasy`. Users can "subscribe" the required data type in the trading strategy through the data ID, and generate trading signals based on these data (for trading signals and trading strategies, please refer to Chapter 4 of the tutorial).
de: Die Daten-ID ist auch das Herzstück der Handelsstrategie in `qteasy`, die es dem Benutzer ermöglicht, den gewünschten Datentyp in der Handelsstrategie zu "abonnieren" und auf Basis dieser Daten Handelssignale zu generieren (siehe Kapitel 4 des Tutorials für weitere Informationen zu Handelssignalen und Handelsstrategien).

# 根据您的网络环境和数据量大小，下载数据的时间可能会有所不同，下载完成后，2023年内的所有股票数据就可以直接获取了。
source: Considering your network environment and the size of the data, the time to download the data may vary. After the download is complete, all stock data in 2023 can be obtained directly.
de: Abhängig von Ihrer Netzwerkumgebung und der Datengröße kann der Download der Daten unterschiedlich lange dauern. Sobald der Download abgeschlossen ist, sind alle Bestandsdaten für das Jahr 2023 direkt verfügbar.

source: To obtain historical data, you can use the `get_history_data` function, specify the data type, stock code, start date, and end date in the parameters. The following code can obtain the opening price, highest price, lowest price, closing price, trading volume, turnover, etc. of stock 000001.SZ from January 1, 2023 to March 1, 2023:
de: Um historische Daten zu erhalten, können Sie die Funktion `get_history_data` verwenden, wobei Sie den Datentyp, den Aktiencode, das Startdatum und das Enddatum in den Parametern angeben. Der folgende Code kann den Eröffnungskurs, den Höchstkurs, den Tiefstkurs, den Schlusskurs, das Volumen, den Umsatz und andere Daten für die Aktie 000001.SZ vom 1. Januar 2023 bis zum 1. März ermitteln:
