Repository: 18773262/qteasy
Catalog: docs/source/locale/*/LC_MESSAGES/tutorials/1-get-started.po
Languages: de

# 至此，如果您看到上面的数据，表明`qteasy`的安装和初始化工作已经完成，您已经可以开始使用`qteasy`了。
source: At this point, if you see the data above, it means that the installation and initialization of `qteasy` have been completed, and you can start using `qteasy`.
de: Wenn Sie jetzt die obigen Daten sehen, bedeutet dies, dass die Installation und Initialisierung von `qteasy` abgeschlossen ist und Sie bereit sind, `qteasy` zu benutzen.

# 在下一章节中，我们将会介绍`qteasy`的基本数据类型，以及如何使用`qteasy`来获取并管理金融数据。
source: In the next chapter, we will introduce the basic data types of `qteasy`, and how to use `qteasy` to obtain and manage financial data.
de: Im nächsten Abschnitt werden wir die grundlegenden Datentypen von `qteasy` und die Verwendung von `qteasy` zur Beschaffung und Verwaltung von Finanzdaten behandeln.

# API 参考
source: A
de: API-Referenz

# 关于qteasy环境变量的AP，以及所有的环境变量，请参考 [Configuration APIs](../api/api_reference.rst)
source: About the AP of qteasy environment variables, and all environment variables, please refer to [Configuration APIs](../api/api_reference.rst)
de: Für die AP der qteasy-Umgebungsvariablen, und zwar aller, siehe [Configuration APIs] (... /api/api_reference.rst)
