Repository: 18773262/qteasy
Catalog: docs/source/locale/*/LC_MESSAGES/tutorials/1-get-started.po
Languages: de

# 安装方法及初始配置
source: How to install and initial configuration
de: Installation und Konfiguration

# 金融数据的获取、清洗、存储以及处理、可视化、使用
source: Financial data acquisition, cleaning, storage, processing, visualization, and use
de: Beschaffung, Bereinigung, Speicherung und Verarbeitung, Visualisierung, Nutzung von Finanzdaten

# 量化交易策略的创建，并提供大量内置基本交易策略
source: Quantitative trading strategy creation, and provide a large number of built-in basic trading strategies
de: Quantitative Handelsstrategieerstellung mit einer großen Anzahl integrierter Basishandelsstrategien

# 向量化的高速交易策略回测及交易结果评价
source: Vectorized high-speed trading strategy backtesting and trading result evaluation
de: Backtesting von Hochgeschwindigkeitshandelsstrategien zur Quantifizierung und Bewertung der Handelsergebnisse

# 交易策略参数的优化以及评价
source: Optimization and evaluation of trading strategy parameters
de: Optimierung und Bewertung der Parameter der Handelsstrategie

# 交易策略的部署、实盘运行
source: Deployment and live operation of trading strategies
de: Einsatz von Handelsstrategien, Live-Läufe

source: Here is a series of tutorials to help you understand the main functions and usage of `qteasy` through a series of practical examples.
de: qteasy" wurde in Python entwickelt und verwendet eine vektorisierte Backtesting- und Handelssimulations-Engine, um ein schnelles Backtesting von Strategien zu ermöglichen, während gleichzeitig die Flexibilität des Strategieframeworks berücksichtigt wird, das es dem Benutzer ermöglicht, fortgeschrittene Strategien nach seinen Bedürfnissen anzupassen. qteasy" bietet eine Vielzahl von Algorithmen zur Optimierung von Strategieparametern, die bei der Optimierung und Bewertung von Handelsstrategien helfen, sowie einen Echtzeit-Laufzeitmodus, mit dem Handelsstrategien direkt eingesetzt werden können.

# 通过本系列教程，您将会通过一系列的实际示例，充分了解`qteasy`的主要功能以及使用方法。
source: `qteasy` is created using `python`, and uses a vectorized backtesting and trading simulation engine to achieve high-speed backtesting of strategies, while also taking into account the flexibility of the strategy framework, allowing users to customize various advanced strategies as needed. `qteasy` provides a variety of strategy parameter optimization algorithms to help optimize and evaluate trading strategies, and provides real-time operation mode, allowing trading strategies to be directly deployed and used.
de: Durch diese Reihe von Tutorials erhalten Sie ein umfassendes Verständnis der Hauptfunktionen von `qteasy` und wie man es durch eine Reihe von praktischen Beispielen benutzt.

# `qteasy`安装前的准备工作
source: Preparation before installing `qteasy`
de: Vorbereitung für die Installation von `qteasy`

# 创建安装环境
source: Create installation environment
de: Erstellen der Installationsumgebung

source: `qteasy` can be installed via `pip`. Since there are many dependent packages, to avoid conflicts between the dependent packages and the packages in the existing environment, it is recommended to create an independent `python` environment to install `qteasy`.
de: `qteasy` kann über `pip` installiert werden, aufgrund der großen Anzahl von Abhängigkeiten wird empfohlen, eine separate `python` Umgebung für die Installation von `qteasy` zu erstellen, um Konflikte zwischen den Abhängigkeiten und Paketen in Ihrer bestehenden Umgebung zu vermeiden.

# 创建虚拟环境的方法有很多种，这里介绍两种方法，分别是使用`venv`和`conda`：
source: Here are two methods to create a virtual environment, using `venv` and `conda` respectively:
de: Es gibt verschiedene Möglichkeiten, virtuelle Umgebungen zu erstellen, von denen hier zwei beschrieben werden: `venv` und `conda`:

source: Users of macOS and Linux can open the terminal, enter the path where you need to create the environment, and enter the following command to create a virtual environment named `qteasy-env` in the current directory and activate the environment:
de: Um eine virtuelle Umgebung mit `venv` zu erstellen, können macOS- und Linux-Benutzer Terminal öffnen, zu dem Pfad gehen, in dem Sie die Umgebung erstellen müssen, und den folgenden Befehl eingeben, um eine virtuelle Umgebung namens `qteasy-env` im aktuellen Verzeichnis zu erstellen und die Umgebung zu aktivieren:

# Windows用户可以打开命令提示符，进入您需要创建环境的文件夹，输入以下命令，创建虚拟环境并激活：
source: Windows users can open the command prompt, enter the folder where you need to create the environment, enter the following command to create a virtual environment and activate it:
de: Windows-Benutzer können eine virtuelle Umgebung erstellen und aktivieren, indem sie eine Eingabeaufforderung öffnen, zu dem Ordner gehen, in dem sie die Umgebung erstellen möchten, und den folgenden Befehl eingeben:

# 要使用conda创建虚拟环境，可以打开终端，输入以下命令，创建一个名为`qteasy-env`的虚拟环境，并激活环境：
source: Users can open the terminal, enter the following command to create a virtual environment named `qteasy-env` and activate the environment:
de: Um eine virtuelle Umgebung mit conda zu erstellen, können Sie ein Terminal öffnen und den folgenden Befehl eingeben, um eine virtuelle Umgebung mit dem Namen `qteasy-env` zu erstellen und die Umgebung zu aktivieren:

# 在激活的虚拟环境中，使用以下命令安装`qteasy`：
source: Use the following command to install `qteasy` in the activated virtual environment:
de: In einer aktivierten virtuellen Umgebung installieren Sie `qteasy` mit dem folgenden Befehl:

# 安装`MySQL`数据库 (可选)
source: Install `MySQL` database (optional)
de: Installation der Datenbank "MySQL" (optional)

source: `qteasy` can manage a large amount of financial data. The way `qteasy` works is to download all financial data to the local machine, clean it, and store it in a predefined data table. When needed (generating K-line charts, generating trading signals, simulating trading backtesting, trading result evaluation, etc., all links require financial data), the required data is read directly from the local data source. Therefore, a data management environment must be set up locally.
de: `qteasy` kann große Mengen von Finanzdaten verwalten. `qteasy` lädt alle Finanzdaten lokal herunter, bereinigt sie, speichert sie in vordefinierten Datentabellen und liest die benötigten Daten bei Bedarf direkt aus der lokalen Datenquelle (Finanzdaten werden für alle Aspekte der K-Chart-Generierung, der Generierung von Handelssignalen, des simulierten Handels-Backtestings, der Auswertung von Handelsergebnissen usw. benötigt). Daher muss eine lokale Datenverwaltungsumgebung eingerichtet werden.

# `qteasy`同时支持数据库及文件系统作为数据管理环境，考虑到金融数据量，强烈推荐使用数据库作为本地数据源。`qteasy`支持的本地数据源包括：
source: `qteasy` supports both databases and file systems as data management environments. Considering the amount of financial data, it is strongly recommended to use a database as a local data source. The local data sources supported by `qteasy` include:
de: `qteasy` unterstützt sowohl Datenbanken als auch Dateisysteme als Datenverwaltungsumgebungen. In Anbetracht des Umfangs von Finanzdaten ist es sehr empfehlenswert, Datenbanken als lokale Datenquellen zu verwenden. Zu den von `qteasy` unterstützten lokalen Datenquellen gehören:

# **`csv` 文件** 默认数据源。占用空间大，但是可以使用Excel读取本地数据，数据量大时速度慢
source: Use **`csv` file** as the default data source. It takes up a lot of space, but you can use Excel to read local data. It is slow when the data volume is large
de: **`csv`-Datei** Standard-Datenquelle. Nimmt viel Platz in Anspruch, aber Sie können Excel verwenden, um lokale Daten zu lesen, aber es ist langsam, wenn es eine Menge Daten gibt.

# **`mysql` 数据库**，强烈推荐使用mysql数据库并确保磁盘有至少1TB的存储空间，速度快
source: Highly recommended to use **`mysql` database** and ensure that the disk has at least 1TB of storage space, which is fast
de: **:: `mysql'-Datenbank**, es wird dringend empfohlen, die mysql-Datenbank zu verwenden und sicherzustellen, dass mindestens 1 Terabyte Speicherplatz auf der Festplatte vorhanden ist, was schnell ist

# **`hdf5` 文件** 占用空间大，数据量大时速度慢
source: **`hdf5` file** takes up a lot of space, and is slow when the data volume is large
de: **:: "hdf5"-Dateien** nehmen viel Platz in Anspruch und sind bei großen Datenmengen langsam

# **`feather` 文件** 占用空间较小，数据量大时速度慢
source: **`feather` file** takes up less space, and is slow when the data volume is large
de: **`Feder`-Datei** Kleinerer Fußabdruck, langsamer bei großen Datenmengen

# 为了实现最佳的数据存储效率，建议使用`mysql`数据库作为本地数据源。
source: To achieve the best data storage efficiency, it is recommended to use `mysql` database as the local data source.
de: Für eine optimale Effizienz der Datenspeicherung wird empfohlen, eine `mysql`-Datenbank als lokale Datenquelle zu verwenden.

# 如果需要使用数据库作为本地数据源，参照以下方法安装`MySQL`数据库，如果使用文件作为本地数据源，可以跳过这一步。
source: If you need to use a database as a local data source, refer to the following method to install `MySQL` database. If you use a file as a local data source, you can skip this step.
de: Wenn Sie eine Datenbank als lokale Datenquelle verwenden müssen, beachten Sie die folgende Methode zur Installation der `MySQL`-Datenbank. Wenn Sie eine Datei als lokale Datenquelle verwenden, können Sie diesen Schritt überspringen.

source: You can directly find the community open source version for download on the [official website](https://dev.mysql.com/downloads/mysql/): The website provides a variety of different installation methods such as dmg and tar, and there are also versions available for the Apple M1 chip:
de: Die Open-Source-Version der Gemeinschaft ist direkt auf der [offiziellen Website] von MySQL (https://dev.mysql.com/downloads/mysql/) zu finden: Die Website bietet eine Reihe verschiedener Installationsmethoden wie dmg und tar, und es ist auch eine Version für den Apple M1-Chip verfügbar:

# 安装完成后，创建用户，设置访问方式并设置密码：
source: Install the database, create a user, set the access method, and set the password:
de: Nach Abschluss der Installation erstellen Sie einen Benutzer, legen die Zugriffsmethode fest und vergeben ein Passwort:

# 数据库设置好之后，`qteasy`会自动创建数据库表，将金融数据存储到数据库中。
source: The database is set up, `qteasy` will automatically create database tables and store financial data in the database.
de: Sobald die Datenbank eingerichtet ist, erstellt `qteasy` automatisch Datenbanktabellen, um die Finanzdaten in der Datenbank zu speichern.

# 安装`pymysql`
source: Install `pymysql`
de: Installation von `pymysql`

# 创建`tushare`账号并获取API token (可选)
source: How to create a `tushare` account and get the API token (optional)
de: Erstellen eines "tushare"-Kontos und Abrufen eines API-Tokens (optional)

# `qteasy`可以从多个不同的网络金融数据提供商获取金融数据，将他们清洗、整理、一致化以后保存在本地数据库中。
source: `qteasy` can obtain financial data from multiple different network financial data providers, clean, organize, and save them in a local database after they are consistent.
de: `qteasy` kann Finanzdaten von verschiedenen webbasierten Finanzdatenanbietern beziehen, sie bereinigen, organisieren und auf konsistente Art und Weise in lokalen Datenbanken speichern.

source: Although `qteasy` is constantly adding financial data acquisition channels, it still mainly relies on `tushare`. The system has a relatively complete `tushare` interface API. Since the `tushare` interface requires permissions or points, it is recommended that users prepare the corresponding `tushare` points in advance and open the corresponding permissions.
de: Obwohl qteasy die Zahl der Finanzdatenquellen ständig erweitert, stützt es sich immer noch stark auf `tushare`. In das System ist eine vollständige "Tushare"-Schnittstellen-API eingebaut, und da alle "Tushare"-Schnittstellen Berechtigungen oder Kredite erfordern, wird empfohlen, dass die Benutzer die entsprechenden "Tushare"-Kredite im Voraus vorbereiten und die entsprechenden Berechtigungen aktivieren.

# 注册tushare账号和权限的方法请参见[tushare pro主页](https://tushare.pro):
source: For the method of registering a `tushare` account and permissions, please refer to the [tushare pro homepage](https://tushare.pro):
de: Um sich für ein tushare-Konto und die entsprechenden Berechtigungen zu registrieren, besuchen Sie die [tushare pro homepage](https://tushare.pro).

source: 如果不创建`tushare`账号，`qteasy`仍然可以获得一些数据，但是数据的种类非常有限，访问频率和次数也受到限制，很多`qteasy`功能的使用将会受到限制，如下图所示:
de: Wenn Sie kein `tushare`-Konto einrichten, hat `qteasy` zwar immer noch Zugriff auf einige Daten, aber die Vielfalt der Daten ist sehr begrenzt, ebenso die Häufigkeit und Anzahl der Zugriffe, und die Nutzung vieler Funktionen von `qteasy` ist eingeschränkt, wie in der folgenden Abbildung dargestellt.

# 目前已经有部分高频金融数据可以通过`akshare`或者东方财富网免费获取，未来的版本更新中会进一步增加通过其他网络渠道获取的数据。
source: Currently, some high-frequency financial data can be obtained for free through `akshare` or East Money, and more data obtained through other network channels will be added in future version updates.
de: Einige der Hochfrequenz-Finanzdaten sind bereits kostenlos über "Akshare" oder "Oriental Wealth" verfügbar, und Daten, die über andere Online-Kanäle verfügbar sind, werden in zukünftigen Versions-Updates weiter hinzugefügt.

# 安装TA-lib (可选)
source: Install TA-lib (optional)
de: TA-lib installieren (optional)

source: `qteasy` has a large number of technical indicators built in, and the calculation of these technical indicators depends on `TA-lib`. If you need to use all the technical indicators built into `qteasy`, you need to install `TA-lib`. If you skip this step, you will only be able to use the following built-in strategies. Here is the [complete list of built-in strategies and detailed explanations in the reference document](https://qteasy.readthedocs.io/en/latest/api/Built_In.html) and [built-in trading strategy backtesting results](https://qteasy.readthedocs.io/en/latest/references/1-build-in-results.html):
de: `qteasy` hat eine große Anzahl von eingebauten technischen Indikatoren, die für ihre Berechnung auf `TA-lib` angewiesen sind. Wenn Sie alle eingebauten technischen Indikatoren von `qteasy` nutzen wollen, müssen Sie `TA-lib` installieren. Wenn Sie diesen Schritt überspringen, können Sie nur die folgenden eingebauten Strategien verwenden, hier ist die [vollständige Liste der eingebauten Strategien mit detaillierter Beschreibung](https://qteasy.readthedocs.io/zh/latest/api/Built_In.html) und [Backtest-Ergebnisse der eingebauten Handelsstrategien](https://) qteasy.readthedocs.io/zh/latest/references/1-build-in-results.html).

# 策略名称
source: Strategy name
de: Strategie Name

# 说明
source: Instructions
de: Anweisungen

source: crossline
de: Querverbindung

source: TimingCrossline
de: Zeitlicher Querstrich

source: crossline timing strategy class, using the cross of long and short moving averages to determine the long and short states<br />1. When the short moving average is above the long moving average and the distance is greater than l\*m%, set the position target to 1<br />2. When the short moving average is below the long moving average and the distance is greater than l\*m%, set the position target to -1<br />3. When the distance between the long and short moving averages is not greater than l\*m%, set the position target to 0
de: Crossline-Timing-Strategieklasse, die den Schnittpunkt der langen und kurzen Durchschnitte zur Bestimmung des Long- und Short-Status verwendet <br />1, wenn die kurzen Durchschnitte über den langen Durchschnitten liegen und der Abstand größer als l\*m% ist, setzen Sie das Positionsziel auf 1 <br />2, wenn die kurzen Durchschnitte unter den langen Durchschnitten liegen und der Abstand größer als l\*m% ist, setzen Sie das Positionsziel auf -1 <br />3, wenn der Abstand zwischen den langen und kurzen Durchschnitten nicht größer als l\*m% ist, setzen Sie das Positionsziel auf 0

source: MACD timing strategy class, using the MACD moving average strategy to generate the target position percentage:<br />1. When the MACD value is greater than 0, set the position target to 1<br />2. When the MACD value is less than 0, set the position target to 0
de: MACD-Timing-Strategieklasse, die die MACD-Durchschnittsstrategie verwendet, erzeugt einen Zielpositionsprozentsatz: <br />1, wenn der MACD-Wert größer als 0 ist, wird das Positionsziel auf 1 gesetzt <br />2, wenn der MACD-Wert kleiner als 0 ist, wird das Positionsziel auf 0 gesetzt

source: DMA timing strategy<br />1. When DMA is above AMA, it is a long interval, that is, after the DMA line crosses the AMA line from bottom to top, the output is 1<br />2. When DMA is below AMA, it is a short interval, that is, after the DMA line crosses the AMA line from top to bottom, the output is 0
de: DMA-Timing-Strategie <br />1, DMA oberhalb AMA, langer Bereich, d.h. nachdem die DMA-Linie die AMA-Linie von unten nach oben kreuzt, ist der Ausgang 1 <br />2, DMA unterhalb AMA, kurzer Bereich, d.h. nachdem die DMA-Linie die AMA-Linie von oben nach unten kreuzt, ist der Ausgang 0

source: TRIX timing strategy, using the triple-smoothed exponential moving average price of the stock price for long and short judgment:<br />Calculate the triple-smoothed exponential moving average price TRIX of the price, and then calculate the moving average of the M-day TRIX:<br />1. When TRIX is above MATRIX, set the position target to 1<br />2. When TRIX is below MATRIX, set the position target to -1
de: TRIX-Timing-Strategie, die den dreifach geglätteten exponentiellen gleitenden Durchschnitt der Aktienkurse verwendet, um Long/Short-Entscheidungen zu treffen: <br />Berechnen Sie den dreifach geglätteten exponentiellen gleitenden Durchschnitt der Kurse TRIX, und berechnen Sie dann einen gleitenden Durchschnitt des M-Tages TRIX: <br />1, Setzen Sie das Positionsziel auf 1, wenn TRIX über MATRIX liegt <br />2, Setzen Sie das Positionsziel auf -1, wenn TRIX unter MATRIX liegt

# 单均线交叉策略——SMA均线(简单移动平均线)：根据股价与SMA均线的相对位置设定持仓比例
source: Single moving average cross strategy - SMA moving average (simple moving average): set the position ratio based on the relative position of the stock price and the SMA moving average
de: Single-SMA-Crossover-Strategie - SMA (Simple Moving Average): Festlegung eines Positionsverhältnisses auf der Grundlage der relativen Position des Aktienkurses zum SMA

# 单均线交叉策略——EMA均线(指数平滑移动均线)：根据股价与EMA均线的相对位置设定持仓比例
source: Single moving average cross strategy - EMA moving average (exponential smoothing moving average): set the position ratio based on the relative position of the stock price and the EMA moving average
de: Single SMA Crossover Strategy - EMA SMA (Exponential Smoothed Moving Average): Die Positionierung basiert auf der relativen Position des Aktienkurses zum EMA SMA.

# 双均线交叉策略——SMA均线(简单移动平均线)：<br />基于SMA均线计算规则生成快慢两根均线，根据快与慢两根均线的相对位置设定持仓比例
source: Double moving average cross strategy - SMA moving average (simple moving average):<br />Based on the SMA moving average calculation rules to generate fast and slow moving averages, set the position ratio based on the relative position of the fast and slow moving averages
de: Doppel-SMA-Crossover-Strategie - SMA (Einfacher gleitender Durchschnitt): <br />Erzeugen Sie zwei SMAs, einen schnellen und einen langsamen, auf der Grundlage der SMA-Berechnungsregeln, und legen Sie die Positionsverhältnisse auf der Grundlage der relativen Positionen des schnellen und des langsamen SMAs fest.

# 双均线交叉策略——SMA均线(简单移动平均线)：<br />基于EMA均线计算规则生成快慢两根均线，根据快与慢两根均线的相对位置设定持仓比例
source: Double moving average cross strategy - EMA moving average (exponential smoothing moving average):<br />Based on the EMA moving average calculation rules to generate fast and slow moving averages, set the position ratio based on the relative position of the fast and slow moving averages
de: Double SMA crossover strategy - SMA (Simple Moving Average): <br />Basierend auf den EMA SMA Berechnungsregeln, um die schnellen und langsamen SMAs zu generieren, basierend auf der relativen Position der schnellen und langsamen SMAs, um den Anteil der Positionen festzulegen

# 均线斜率交易策略——EMA均线(指数平滑移动平均线)：<br />基于EMA计算规则生成移动均线，根据均线的斜率设定持仓比例目标
source: Moving average slope trading strategy - EMA moving average (exponential smoothing moving average):<br />Based on the EMA calculation rules to generate moving averages, set the position ratio target based on the slope of the moving average
de: SMA Slope Trading Strategy - EMA SMA (Exponential Smoothing Moving Average): <br />Erzeugen Sie gleitende Durchschnitte auf der Grundlage der EMA-Berechnungsregeln und setzen Sie prozentuale Positionsziele auf der Basis der Steigung der Durchschnitte.

source: signal_none
de: signal_kein

# 空交易信号策略：不生成任何交易信号的策略
source: Empty trading signal strategy: a strategy that does not generate any trading signals
de: Strategie mit leeren Handelssignalen: eine Strategie, die keine Handelssignale erzeugt

source: sellrate
de: Verkaufsrate

source: SellRate
de: Verkaufskurs

source: Change rate sell signal strategy: when the change rate of the price exceeds the threshold, a sell signal is generated<br />1. When change > 0 and the daily increase is greater than change, a -1 sell signal is generated<br />2. When change < 0 and the daily decline is greater than change, a -1 sell signal is generated
de: Veränderungsrate-Verkaufssignal-Strategie: Erzeugt ein Verkaufssignal, wenn die Veränderungsrate des Preises einen Schwellenwert überschreitet <br />1, -1 Verkaufssignal, wenn Veränderung &gt; 0 und der tägliche Anstieg des Tages größer als die Veränderung ist <br />2, -1 Verkaufssignal, wenn Veränderung &lt; 0 und der tägliche Rückgang des Tages größer als die Veränderung ist

source: buyrate
de: kaufen

source: BuyRate
de: Kaufkurs

source: Change rate buy signal strategy: when the change rate of the price exceeds the threshold, a buy signal is generated<br />1. When change > 0 and the daily increase is greater than change, a 1 buy signal is generated<br />2. When change < 0 and the daily decline is greater than change, a 1 buy signal is generated
de: Veränderungsrate-Kaufsignal-Strategie: Erzeugt ein Kaufsignal, wenn die Veränderungsrate des Preises einen Schwellenwert übersteigt <br />1, 1 Kaufsignal, wenn VERÄNDERUNG &gt; 0 und TAG täglicher Anstieg größer als VERÄNDERUNG ist <br />2, 1 Kaufsignal, wenn VERÄNDERUNG &lt; 0 und TAG täglicher Rückgang größer als VERÄNDERUNG ist

source: Long
de: lang

source: TimingLong
de: Langes Timing

# 简单择时策略，整个历史周期上固定保持多头全仓状态
source: Simple timing strategy, fixed long position throughout the entire historical period
de: Einfache Timing-Strategie mit einer über den gesamten historischen Zyklus festgelegten Long-Position

source: short
de: kurz

source: TimingShort
de: ZeitmessungKurz

# 简单择时策略，整个历史周期上固定保持空头全仓状态
source: Simple timing strategy, fixed short position throughout the entire historical period
de: Einfache Timing-Strategie mit einer festen Short-Position während des gesamten historischen Zyklus

source: zero
de: Null

# `TimingZero`
source: T
de: TimingZero

# 简单择时策略，整个历史周期上固定保持空仓状态
source: Simple timing strategy, fixed empty position throughout the entire historical period
de: Einfache Timing-Strategie mit festen Short-Positionen während des gesamten historischen Zyklus

source: all
de: alle

source: SelectingAll
de: Alles auswählen

# 保持历史股票池中的所有股票都被选中，投资比例平均分配
source: Keep all stocks in the historical stock pool selected, and the investment ratio is evenly distributed
de: Beibehaltung aller ausgewählten Aktien des historischen Aktienpools bei gleichmäßiger Aufteilung der Investitionsquote

source: select_none
de: wählen_keine

source: SelectingNone
de: AuswahlKeine

# 保持历史股票池中的所有股票都不被选中，投资仓位为0
source: Keep all stocks in the historical stock pool unselected, and the investment position is 0
de: Alle Aktien im historischen Bestandspool ungeprüft mit einer Investitionsposition von 0 belassen

source: random
de: zufällig

source: SelectingRandom
de: AuswahlZufall
