Repository: 18773262/qteasy
Catalog: docs/source/locale/*/LC_MESSAGES/tutorials/6-more-self-defined-strategies.po
Languages: de

# 创建自定义因子选股交易策略
source: Another Custom Strategy
de: Erstellen Sie benutzerdefinierte Faktor-Aktienauswahl-Handelsstrategien

# `qteasy`是一个完全本地化部署和运行的量化交易分析工具包，具备以下功能：
source: `qteasy` is a fully localized deployment and operation of quantitative trading analysis toolkit, with the following functions:
de: `qteasy` ist ein vollständig lokalisiertes und betriebenes Quantitative Trading-Analyse-Toolkit mit folgenden Funktionen:

# 金融数据的获取、清洗、存储以及处理、可视化、使用
source: Acquisition, cleaning, storage, processing, visualization, and use of financial data
de: Erfassung, Reinigung, Speicherung und Verarbeitung von Finanzdaten, Visualisierung und Verwendung

# 量化交易策略的创建，并提供大量内置基本交易策略
source: Create quantitative trading strategies and provide a large number of built-in basic trading strategies
de: Erstellung quantitativer Handelsstrategien und Bereitstellung einer Vielzahl von integrierten grundlegenden Handelsstrategien

# 向量化的高速交易策略回测及交易结果评价
source: Vectorized high-speed trading strategy backtesting and trading result evaluation
de: Vektorisierte Hochgeschwindigkeits-Backtests von Handelsstrategien und Bewertung der Handelsergebnisse

# 交易策略参数的优化以及评价
source: Optimization and evaluation of trading strategy parameters
de: Optimierung und Bewertung von Handelsstrategieparametern

# 交易策略的部署、实盘运行
source: Deployment and live operation of trading strategies
de: Bereitstellung von Handelsstrategien und Durchführung von Live-Trades

# 通过本系列教程，您将会通过一系列的实际示例，充分了解`qteasy`的主要功能以及使用方法。
source: In this tutorial, you will fully understand the main functions and usage of `qteasy` through a series of practical examples.
de: Durch diese Tutorials werden Sie anhand einer Reihe praktischer Beispiele die Hauptfunktionen und Verwendungsmethoden von `qteasy` vollständig verstehen.

# 开始前的准备工作
source: Before you start
de: Vorbereitungen vor dem Start

# 在开始本节教程前，请先确保您已经掌握了下面的内容：
source: Please make sure you have mastered the following content before starting this tutorial:
de: Bevor Sie mit diesem Tutorial beginnen, stellen Sie bitte sicher, dass Sie Folgendes beherrschen:

# **安装、配置`qteasy`** —— [QTEASY教程1](1-get-started.md)
source: **Install and configure `qteasy`** —— [QTEASY Tutorial 1](1-get-started.md)
de: **Installieren und Konfigurieren von `qteasy`** - [QTEASY-Tutorial 1](1-get-started.md)

# **学会创建交易员对象，使用内置交易策略**，——[QTEASY教程3](3-start-first-strategy.md)
source: **Learn to create a trader object, use built-in trading strategies** —— [QTEASY Tutorial 3](3-start-first-strategy.md)
de: **Lernen Sie, Händlerobjekte zu erstellen und integrierte Handelsstrategien zu verwenden**, - [QTEASY Tutorial 3](3-start-first-strategy.md)

# **学会使用混合器，将多个简单策略混合成较为复杂的交易策略**——[QTEASY教程4](4-build-in-strategies.md)
source: **Learn to use the mixer to mix multiple simple strategies into more complex trading strategies** —— [QTEASY Tutorial 4](4-build-in-strategies.md)
de: **Lernen Sie, einen Mixer zu verwenden, um mehrere einfache Strategien zu komplexeren Handelsstrategien zu verbinden** - [QTEASY Tutorial 4](4-build-in-strategies.md)

# **了解如何自定义交易策略**——[QTEASY教程5](5-first-self-defined-strategy.md)
source: **Learn how to customize trading strategies** —— [QTEASY Tutorial 5](5-first-self-defined-strategy.md)
de: **Erfahren Sie, wie Sie Ihre Handelsstrategie anpassen**——[QTEASY-Tutorial 5](5-first-self-defined-strategy.md)

source: In the [QTEASY documentation](https://qteasy.readthedocs.io/zh/latest/), you can find more information about using built-in trading strategies, creating custom strategies, and so on. If you are not familiar with the basic usage of `qteasy`, you can go there to see more detailed instructions.
de: Im [QTEASY-Dokument](https://qteasy.readthedocs.io/zh/latest/) finden Sie auch weitere Informationen zur Verwendung integrierter Handelsstrategien, zur Erstellung benutzerdefinierter Strategien usw. Wenn Sie mit den grundlegenden Verwendungsmethoden von `qteasy` noch nicht vertraut sind, können Sie dort weitere detaillierte Erklärungen finden.

# 本节的目标
source: Target of this tutorial
de: Ziele dieses Abschnitts

source: In order to provide sufficient ease of use, the various strategy base classes provided by `qteasy` are essentially the same, just a pre-processing form provided to reduce the user's coding workload, and even different trading strategy base classes can be understood as "syntax sugar" designed for specific trading strategies. Therefore, the same trading strategy can often be implemented using multiple different trading strategy base classes. Therefore, in this section, we will use two different strategy base classes to implement an Alpha stock selection trading strategy.
de: Um einen ausreichenden Komfort zu gewährleisten, sind die verschiedenen Strategie-Basisklassen von `qteasy` im Wesentlichen identisch. Es handelt sich lediglich um Vorverarbeitungsformen, die den Programmieraufwand des Benutzers reduzieren. Verschiedene Handelsstrategie-Basisklassen können sogar als „syntaktischer Zucker“ für spezifische Handelsstrategien verstanden werden. Daher kann dieselbe Handelsstrategie oft mit mehreren verschiedenen Handelsstrategie-Basisklassen implementiert werden. In diesem Abschnitt verwenden wir daher zwei verschiedene Strategie-Basisklassen, um eine Alpha-Aktienauswahl-Handelsstrategie zu implementieren.

# Alpha选股策略的选股思想
source: How Alpha stock selection strategy works
de: Alpha-Aktienauswahlstrategie, Ideen zur Aktienauswahl

source: The Alpha stock selection strategy we are discussing here is a low-frequency stock selection strategy that can run weekly or monthly. Each time the stock is selected, it will traverse all the constituent stocks of the HS300 index, and prioritize these 300 stocks according to certain criteria. Select the top 30 stocks from them, hold them equally, that is, rebalance the stocks once a month, sell the stocks with lower rankings during the rebalancing, buy the stocks with higher rankings, and ensure that the stocks are held in equal shares.
de: Die hier besprochene Alpha-Aktienauswahlstrategie ist eine Strategie mit niedriger Aktienfrequenz. Diese Strategie kann wöchentlich oder monatlich angewendet werden. Bei jeder Aktienauswahl werden alle im HS300-Index enthaltenen Aktien durchsucht, nach bestimmten Kriterien priorisiert und die 30 besten Aktien daraus ausgewählt und gleichmäßig gehalten. Das heißt, das Portfolio wird monatlich angepasst, wobei die Aktien mit niedrigerem Ranking verkauft und die Aktien mit höherem Ranking gekauft werden. Dabei wird sichergestellt, dass die Aktienbestände gleich bleiben.

source: Alpha stock selection strategy is based on two financial indicators of each stock: EV (enterprise market value) and EBITDA (profit before interest, tax, depreciation, and amortization) to calculate. Calculate the ratio of EV to EBITDA for each stock. When this ratio is greater than 0, it means that the listed company is profitable (because EBITDA is positive). At this time, this ratio represents the total value of the company that needs to be invested for each dollar of profit earned. Naturally, the lower the ratio, the better. For example, the data of the following two listed companies are as follows:
de: Das Ranking der Alpha-Aktienauswahlstrategie basiert auf zwei Finanzkennzahlen jeder Aktie: EV (Unternehmensmarktwert) und EBITDA (Gewinn vor Zinsen, Steuern und Abschreibungen). Das Verhältnis von EV zu EBITDA wird für jede Aktie berechnet. Ist dieses Verhältnis größer als 0, bedeutet dies, dass das börsennotierte Unternehmen profitabel ist (da das EBITDA positiv ist). Dieses Verhältnis stellt den gesamten Unternehmenswert dar, der für jeden Dollar Gewinn investiert werden muss. Je niedriger dieses Verhältnis, desto besser. Die Daten der folgenden beiden börsennotierten Unternehmen lauten beispielsweise wie folgt:

# A公司的EBITDA为一千万，而企业市场价值为一百亿，EV/EBITDA=1000.。说明该公司每一千元的市场价值可以挣到一元钱利润
source: Company A's EBITDA is 10 million, and the enterprise market value is 10 billion, EV/EBITDA=1000. It means that the company can earn one yuan profit for every 1000 yuan of market value
de: Das EBITDA von Unternehmen A beträgt 10 Millionen und sein Marktwert 10 Milliarden. EV/EBITDA = 1000. Dies bedeutet, dass das Unternehmen pro 1.000 Yuan Marktwert 1 Yuan Gewinn erzielen kann.

# B公司的EBITDA同样为一千万，企业市场价值为一千亿，EV/EBITDA=10000，说明该公司每一万元的市场价值可以挣到一元钱利润
source: Company B's EBITDA is also 10 million, and the enterprise market value is 100 billion, EV/EBITDA=10000, which means that the company can earn one yuan profit for every 10,000 yuan of market value
de: Das EBITDA von Unternehmen B beträgt ebenfalls 10 Millionen und sein Marktwert 100 Milliarden. EV/EBITDA = 10.000, was bedeutet, dass das Unternehmen pro 10.000 Yuan Marktwert einen Gewinn von 1 Yuan erzielen kann.

# 从常理分析，我们自然会觉得A公司比较好，因为靠着较少的公司市场价值，就挣到了同样的利润，这时我们认为A公司的排名比较靠前。
source: Normally, we naturally feel that Company A is better because it earns the same profit with less company market value. At this time, we think that Company A's ranking is relatively high.
de: Aus gesundem Menschenverstand würden wir natürlich annehmen, dass Unternehmen A besser ist, da es bei geringerem Marktwert den gleichen Gewinn erzielt. Derzeit gehen wir davon aus, dass Unternehmen A einen höheren Rang einnimmt.

source: According to the above rules, at the end of each month, we will rank all listed companies of the HS300 constituent stocks from small to large, and remove companies with EV/EBITDA less than 0 (of course, companies with negative profits should be removed). After that, select the top 30 companies to hold, which is the Alpha stock selection trading strategy.
de: Gemäß den oben genannten Regeln werden wir am letzten Tag jedes Monats alle börsennotierten Unternehmen, die Bestandteile des HS300 sind, von klein bis groß einstufen, Unternehmen mit einem EV/EBITDA von weniger als 0 ausschließen (Unternehmen mit negativen Gewinnen sollten natürlich ausgeschlossen werden) und dann die 30 besten Unternehmen zum Halten auswählen, was der Alpha-Aktienauswahl-Handelsstrategie entspricht.

# 其实，类似于这样的指标排序选股策略，`qteasy`提供了一个内置交易策略可以直接实现：
source: Actually, for stock selection strategies similar to this indicator ranking, `qteasy` provides a built-in trading strategy that can be implemented directly:
de: Tatsächlich bietet „qteasy“ ähnlich dieser Strategie zur Aktienauswahl mit Sortierung nach Indikatoren eine integrierte Handelsstrategie, die direkt implementiert werden kann:

source: But this built-in trading strategy only supports the use of `qteasy` built-in historical data types as stock selection factors. For example, pe price-earnings ratio, profit profit, etc. data are `qteasy` built-in historical data and can be directly referenced. However, if the stock selection factor that cannot be found in the built-in historical data of `qteasy`, the built-in trading strategy cannot be used directly. EV/EBITDA is a calculated indicator, so we must use a custom trading strategy. And calculate this indicator in the custom strategy.
de: Diese integrierte Handelsstrategie unterstützt jedoch nur die in „qteasy“ integrierten historischen Datentypen als Aktienauswahlfaktoren. Beispielsweise sind KGV, Gewinn und andere Daten integrierte historische Daten von „qteasy“ und können direkt referenziert werden. Wenn der Aktienauswahlfaktor jedoch nicht in den integrierten historischen Daten von „qteasy“ enthalten ist, kann die integrierte Handelsstrategie nicht direkt verwendet werden. Der EV/EBITDA-Indikator ist ein berechneter Indikator, daher müssen wir eine benutzerdefinierte Handelsstrategie verwenden und diesen Indikator in der benutzerdefinierten Strategie berechnen.

# 计算选股指标
source: Calculate stock selection indicators
de: Berechnung von Aktienauswahlindikatoren

# 为了计算EV/EBITDA，我们必须至少先确认`qteasy`中是否已经提供了EV和EBITDA这两种历史数据：
source: To calculate EV/EBITDA, we must at least confirm whether `qteasy` has provided EV and EBITDA these two types of historical data:
de: Um EV/EBITDA zu berechnen, müssen wir zunächst bestätigen, ob die historischen Daten von EV und EBITDA bereits in „qteasy“ bereitgestellt werden:

# 我们可以使用`find_history_data()`来查看历史数据是否被`qteasy`支持
source: We can use `find_history_data()` to see if the historical data is supported by `qteasy`
de: Wir können `find_history_data()` verwenden, um zu sehen, ob die historischen Daten von `qteasy` unterstützt werden.

source: From the above return value, it can be seen that in the built-in historical data types of `qteasy`, EBITDA is a standard historical data type, which can be obtained through 'ebitda' / income_ebitda these two IDs (we will use 'ebitda'), but EV enterprise cash value is not in the built-in data type, but we know that EV can be calculated by the following formula:
de: Wie aus dem obigen Rückgabewert ersichtlich ist, ist EBITDA in den integrierten historischen Datentypen von „qteasy“ ein standardmäßiger historischer Datentyp, der über die beiden IDs „ebitda“ / „income_ebitda“ abgerufen werden kann (wir verwenden „ebitda“). Der Unternehmensbarwert EV ist jedoch nicht im integrierten Datentyp enthalten. Wir wissen jedoch, dass EV mit der folgenden Formel berechnet werden kann:

# 而上面几个财务指标都是`qteasy`直接支持的：
source: And the above financial indicators are directly supported by `qteasy`
de: Die oben genannten Finanzindikatoren werden direkt von „qteasy“ unterstützt:

# 总市值 - 数据类型： `total_mv`
source: Total Market Value - Data Type: `total_mv`
de: Gesamtmarktwert - Datentyp: `total_mv`

# 总负债 - 数据类型： `total_liab`
source: Total Liabilities - Data Type: `total_liab`
de: Gesamtverbindlichkeiten – Datentyp: „total_liab“

# 总现金 - 数据类型： `c_cash_equ_end_period`
source: Total Cash - Data Type: `c_cash_equ_end_period`
de: Gesamtbargeld – Datentyp: „c_cash_equ_end_period“

# 我们可以测试一下：
source: Let's test it:
de: Wir können dies testen:

# 可以看到选股因子已经计算出来了，那么我们可以开始定义交易策略了。
source: We can see that the stock selection factor has been calculated, so we can start defining the trading strategy.
de: Sie sehen, dass die Aktienauswahlfaktoren berechnet wurden, sodass wir mit der Definition der Handelsstrategie beginnen können.

source: 用`FactorSorter`定义Alpha选股策略
de: Definieren von Alpha-Aktienauswahlstrategien mit „FactorSorter“

source: 针对这种定时选股类型的交易策略，`qteasy`提供了`FactorSorter`交易策略类，顾名思义，这个交易策略基类允许用户在策略的实现方法中计算一组选股因子，这样策略就可以自动将所有的股票按照选股因子的值排序，并选出排名靠前的股票。至于排序方法、筛选规则、股票持仓权重等都可以通过策略参数设置。
de: Für diese Art von zeitgesteuerter Aktienauswahlstrategie bietet „qteasy“ die Handelsstrategieklasse „FactorSorter“. Wie der Name schon sagt, ermöglicht diese Basisklasse die Berechnung von Aktienauswahlfaktoren in der Strategieimplementierung. So sortiert die Strategie automatisch alle Aktien nach dem Wert des Aktienauswahlfaktors und wählt die am besten bewerteten Aktien aus. Sortiermethode, Auswahlregeln, Aktiengewichtung usw. lassen sich über Strategieparameter festlegen.

source: 如果符合上面定义的交易策略，使用`FactorSorter`策略基类将会非常方便。
de: Wenn Sie zur oben definierten Handelsstrategie passen, ist es sehr praktisch, die Basisklasse der FactorSorter-Strategie zu verwenden.

source: 下面我们就来一步步定义看看，首先继承`FactorSorter`并定义一个类，在上一个章节中，我们在自定义策略的`__init__()`方法中定义名称、描述以及默认参数等信息，然而我们也可以忽略`__init__()`方法，仅仅在创建策略对象时传入参数等信息，这也是可以的，我们在这里就这样做：
de: Definieren wir es Schritt für Schritt. Zunächst erben wir „FactorSorter“ und definieren eine Klasse. Im vorherigen Abschnitt haben wir Name, Beschreibung und Standardparameter in der Methode „__init__()“ der benutzerdefinierten Strategie definiert. Wir können die Methode „__init__()“ jedoch auch ignorieren und nur Parameter und andere Informationen beim Erstellen des Strategieobjekts übergeben. Dies ist ebenfalls möglich. Wir tun dies hier:

source: 与上一节相同，在`realize()`中需要做的第一步是获取历史数据。我们知道历史数据包括`total_mv, total_liab, c_cash_equ_end_period, ebitda`等四种，这些历史数据同样是打包后存储在历史数据属性h中的。与上一章节不同的是，h是一个三维`ndarray`，形状（`shape`）为(L, M, N)，包含L层，M行、N列，分别代表每个股票、每个日期以及每种数据类型。
de: Wie im vorherigen Abschnitt besteht der erste Schritt in „realize()“ darin, historische Daten zu erhalten. Wir wissen, dass historische Daten vier Typen umfassen: „total_mv“, „total_liab“, „c_cash_equ_end_period“ und „ebitda“. Diese historischen Daten werden ebenfalls im historischen Datenattribut h zusammengefasst und gespeichert. Im Gegensatz zum vorherigen Abschnitt ist h ein dreidimensionales „ndarray“ mit der Form („shape“) (L, M, N), das L Ebenen, M Zeilen und N Spalten enthält und jede Aktie, jedes Datum und jeden Datentyp repräsentiert.

source: 因此，要获取四种数据类型最后一个周期的所有股票的数据，应该使用如下方法切片：
de: Um die Daten aller Aktien im letzten Zeitraum der vier Datentypen zu erhalten, sollte daher die folgende Aufteilungsmethode verwendet werden:

source: 这样我们获取到的每一种数据类型都是一个一维数组，这个数组的长度与我们传入的备选股票池中的股票数量相同，每一个元素代表该股票的数据。加入我们的投资股票池中有三支股票，那么total_mv中就会有三个数字，分别代表三支股票的总市值，以此类推。
de: Auf diese Weise ist jeder von uns erhaltene Datentyp ein eindimensionales Array. Die Länge dieses Arrays entspricht der Anzahl der Aktien im übergebenen Kandidatenpool, und jedes Element repräsentiert die Daten der Aktie. Befindet sich in unserem Investment-Aktienpool drei Aktien, enthält total_mv drei Zahlen, die den Gesamtmarktwert der drei Aktien darstellen, und so weiter.

source: 做好上述准备后，计算选股因子就非常方便了，而且，由于我们使用了`FactorSorter`策略基类，计算好选股因子后，直接返回选股因子就可以了，`qteasy`会处理剩下的选股操作：
de: Nach den oben genannten Vorbereitungen ist die Berechnung des Aktienauswahlfaktors sehr einfach. Da wir außerdem die Strategie-Basisklasse „FactorSorter“ verwenden, können wir nach der Berechnung des Aktienauswahlfaktors diesen direkt zurückgeben, und „qteasy“ übernimmt die restlichen Aktienauswahlvorgänge:

source: 至此，仅仅用六行代码，一个自定义Alpha选股交易策略就定义好了。是不是非常简单？
de: An diesem Punkt wurde eine benutzerdefinierte Alpha-Aktienauswahl-Handelsstrategie mit nur sechs Codezeilen definiert. Ist das nicht ganz einfach?

source: 好了，我们来看看回测的结果如何？
de: Okay, sehen wir uns die Backtest-Ergebnisse an.

source: 交易策略的回测结果
de: Backtesting-Ergebnisse von Handelsstrategien

source: 由于我们忽略了策略类的`__init__()`方法，因此在实例化策略对象时，必须输入完整的策略参数：
de: Da wir die Methode `__init__()` der Strategieklasse ignoriert haben, müssen wir beim Instanziieren eines Strategieobjekts die vollständigen Strategieparameter übergeben:

source: 然后创建一个`Operator`对象，因为我们希望控制持仓比例，因此最好使用“PT”信号类型：
de: Erstellen Sie dann ein „Operator“-Objekt. Da wir das Positionsverhältnis steuern möchten, ist es besser, den Signaltyp „PT“ zu verwenden:

source: 回测结果如下：
de: Die Ergebnisse des Backtests lauten wie folgt:

source: ![在这里插入图片描述](../examples/img/output_5_1_2.png)
de: ![Bildbeschreibung hier einfügen](../examples/img/output_5_1_2.png)

source: 在这里插入图片描述
de: Bildbeschreibung hier einfügen

source: 回测结果显示这个策略并不能非常有效地跑赢沪深300指数，不过总体来说回撤较小一些，风险较低，是一个不错的保底策略。
de: Die Backtest-Ergebnisse zeigen, dass diese Strategie den CSI 300 Index nicht sehr effektiv übertreffen kann, aber insgesamt ist der Drawdown kleiner und das Risiko niedriger, was sie zu einer guten Bottom-Line-Strategie macht.

source: 但策略的表现并不是我们讨论的重点，下面我们再来看一看，如果不用`FactorSorter`基类，如何定义同样的Alpha选股策略。
de: Die Performance der Strategie steht jedoch nicht im Mittelpunkt unserer Diskussion. Sehen wir uns an, wie dieselbe Alpha-Aktienauswahlstrategie ohne Verwendung der Basisklasse „FactorSorter“ definiert werden kann.

source: 用`GeneralStg`定义一个Alpha选股策略
de: Definieren Sie eine Alpha-Aktienauswahlstrategie mit „GeneralStg“

source: 前面已经提过了两种策略基类：
de: Zwei Strategie-Basisklassen wurden bereits erwähnt:

source: **`RuleIterator`**： 用户只需要针对一支股票定义选股规则，`qteasy`便能将同样的规则应用到股票池中所有的恶股票上，而且还能针对不同股票设置不同的可调参数
de: **`RuleIterator`**: Benutzer müssen nur Aktienauswahlregeln für eine Aktie definieren, und `qteasy` kann dieselben Regeln auf alle schlechten Aktien im Aktienpool anwenden und auch unterschiedliche anpassbare Parameter für unterschiedliche Aktien festlegen.

source: **`FactorSorter`**：用户只需要定义一个选股因子，`qteasy`便能根据选股因子自动排序后选择最优的股票持有，并卖掉不够格的股票。
de: **`FactorSorter`**: Benutzer müssen nur einen Aktienauswahlfaktor definieren, und `qteasy` kann automatisch entsprechend dem Aktienauswahlfaktor sortieren und die besten Aktien zum Halten auswählen sowie nicht qualifizierte Aktien verkaufen.

source: 而`GeneralStg`是`qteasy`提供的一个最基本的策略基类，它没有提供任何“语法糖”功能，帮助用户降低编码工作量，但是正是因为没有语法糖，它才是一个真正的“万能”策略类，可以用来更加自由地创建交易策略。
de: `GeneralStg` ist die grundlegendste Strategie-Basisklasse von „qteasy“. Sie bietet keine „Syntax Sugar“-Funktion, um den Programmieraufwand zu reduzieren. Gerade aufgrund des fehlenden Syntax Sugars handelt es sich jedoch um eine wirklich universelle Strategieklasse, mit der Handelsstrategien freier entwickelt werden können.

source: 上面的Alpha选股交易策略可以很容易用`FactorSorter`实现，但为了了解`GeneralStg`，我们来看看如何使用它来创建相同的策略：
de: Die oben beschriebene Alpha-Aktienauswahl-Handelsstrategie könnte problemlos mit FactorSorter umgesetzt werden. Um jedoch GeneralStg zu verstehen, sehen wir uns an, wie man damit dieselbe Strategie erstellt:

source: 直接把完整的代码贴出来：
de: Fügen Sie einfach den vollständigen Code ein:

source: 将上面的代码与`FactorSorter`的代码对比，可以发现，`GeneralStg`的代码在计算出选股因子以后，还多出了因子处理的工作：
de: Wenn wir den obigen Code mit dem Code von „FactorSorter“ vergleichen, können wir feststellen, dass der Code von „GeneralStg“ nach der Berechnung der Aktienauswahlfaktoren zusätzliche Faktorverarbeitungsarbeit erfordert:

source: 剔除小于零的因子
de: Eliminieren Sie Faktoren kleiner als Null

source: 排序并选出剩余因子中最小的30个
de: Sortieren und wählen Sie die 30 kleinsten verbleibenden Faktoren aus

source: 选出股票后将他们的持仓比例设置为3.3%
de: Nach der Auswahl der Aktien legen Sie deren Beteiligungsquote auf 3,3 % fest

source: 事实上，上面的这些工作都是`FactorSorter`提供的“语法糖”，在这里我们必须手动实现而已。值得注意的是，我在上面例子中使用的排序等代码都是从`FactorSorter`中直接提取出来的高度优化的`numpy`代码，它们的运行速度是很快的，比一般用户能写出的代码快很多，因此，只要条件允许，用户都应该尽量利用这些语法糖，只有在不得已的情况下才自己编写排序代码。
de: Tatsächlich handelt es sich bei der gesamten oben genannten Arbeit um den von „FactorSorter“ bereitgestellten „Syntaxzucker“, den wir hier manuell implementieren müssen. Es ist erwähnenswert, dass die Sortiercodes, die ich in den obigen Beispielen verwendet habe, hochoptimierte „Numpy“-Codes sind, die direkt aus „FactorSorter“ extrahiert wurden. Sie laufen sehr schnell, viel schneller als der Code, den normale Benutzer schreiben können. Daher sollten Benutzer, sofern es die Bedingungen erlauben, versuchen, diese syntaktischen Zucker zu verwenden und nur dann selbst Sortiercodes zu schreiben, wenn es unbedingt nötig ist.

source: 大家可以研究一下上面的代码，但是请注意，如果使用`GeneralStg`策略类，策略的输出应该是股票的目标仓位，而不是选股因子。
de: Sie können den obigen Code studieren, beachten Sie jedoch, dass bei Verwendung der Strategieklasse „GeneralStg“ die Ausgabe der Strategie die Zielposition der Aktie und nicht der Aktienauswahlfaktor sein sollte.

source: 下面看看回测结果：
de: Werfen wir einen Blick auf die Backtest-Ergebnisse:

source: 回测结果：
de: Backtest-Ergebnisse für die erste Strategie

source: 使用同样的数据进行回测：
de: Backtesting mit denselben Daten:

source: ![在这里插入图片描述](../examples/img/output_7_1.png)
de: ![Bildbeschreibung hier einfügen](../examples/img/output_7_1.png)

source: 两种交易策略的输出结果基本相同
de: Die Ergebnisse der beiden Handelsstrategien sind grundsätzlich gleich

source: 本节回顾
de: Rückblick auf diesen Abschnitt

source: 通过本节的学习，我们了解了`qteasy`提供的另外两种交易策略基类`FactorSorter`和`GeneralStg`的使用方法，实际创建了两个交易策略，虽然使用不同的基类，但是创建出了基本相同的Alpha选股交易策略。
de: Durch das Studium dieses Abschnitts haben wir gelernt, wie man die beiden anderen Handelsstrategie-Basisklassen „FactorSorter“ und „GeneralStg“ von „qteasy“ verwendet und tatsächlich zwei Handelsstrategien erstellt. Obwohl unterschiedliche Basisklassen verwendet wurden, entstand im Grunde dieselbe Handelsstrategie für die Alpha-Aktienauswahl.

source: 在下一个章节中，我们仍然将继续介绍自定义交易策略，但是会用一个更加复杂的例子来演示自定义交易策略的使用方法。敬请期待！
de: Im nächsten Kapitel werden wir weiterhin benutzerdefinierte Handelsstrategien vorstellen, jedoch anhand eines komplexeren Beispiels demonstrieren, wie man benutzerdefinierte Handelsstrategien einsetzt. Bleiben Sie dran!
