Repository: 18773262/qteasy
Catalog: docs/source/locale/*/LC_MESSAGES/tutorials/7-more-complicated-self-define-srtategy.po
Languages: de

# 使用交易策略类，创建更复杂的自定义策略
source: Build a more complicated strategy
de: Verwenden Sie die Handelsstrategieklasse, um komplexere benutzerdefinierte Strategien zu erstellen

source: `qteasy` is a fully localized deployment and operation of quantitative trading analysis toolkit, [Github address is here](https://github.com/shepherdpp/qteasy), and can be installed [via pip](1-get-started.md):
de: `qteasy` ist ein vollständig lokal eingesetztes und lauffähiges Toolkit zur quantitativen Handelsanalyse, [Github-Adresse hier](https://github.com/shepherdpp/qteasy) und kann [über pip](https://blog.csdn.net/ installiert werden shepherdppz/article/details/136075222?spm=1001.2014.3001.5501):

# `qteasy`具备以下功能：
source: `qteasy` has the following functions:
de: `qteasy` hat die folgenden Eigenschaften:

# 金融数据的获取、清洗、存储以及处理、可视化、使用
source: Acquisition, cleaning, storage, processing, visualization, and use of financial data
de: Beschaffung, Bereinigung, Speicherung und Verarbeitung, Visualisierung, Nutzung von Finanzdaten

# 量化交易策略的创建，并提供大量内置基本交易策略
source: Create quantitative trading strategies and provide a large number of built-in basic trading strategies
de: Quantitative Handelsstrategieerstellung mit einer großen Anzahl integrierter Basishandelsstrategien

# 向量化的高速交易策略回测及交易结果评价
source: Vectorized high-speed trading strategy backtesting and trading result evaluation
de: Backtesting von Hochgeschwindigkeitshandelsstrategien zur Quantifizierung und Bewertung der Handelsergebnisse

# 交易策略参数的优化以及评价
source: Optimization and evaluation of trading strategy parameters
de: Optimierung und Bewertung der Parameter der Handelsstrategie

# 交易策略的部署、实盘运行
source: Deployment and live operation of trading strategies
de: Einsatz von Handelsstrategien, Live-Läufe

# 通过本系列教程，您将会通过一系列的实际示例，充分了解`qteasy`的主要功能以及使用方法。
source: In these tutorials, you will learn the main functions and usage of `qteasy` through a series of practical examples.
de: Durch diese Reihe von Tutorials erhalten Sie ein umfassendes Verständnis der Hauptfunktionen von `qteasy` und wie man es durch eine Reihe von praktischen Beispielen benutzt.

# 开始前的准备工作
source: Before you start
de: Vorbereitung des Starts

# 在开始本节教程前，请先确保您已经掌握了下面的内容：
source: Please make sure you have mastered the following content before starting this tutorial:
de: Bevor Sie mit diesem Teil des Tutorials beginnen, sollten Sie sich vergewissern, dass Sie die folgenden Punkte beherrschen:

# **安装、配置`qteasy`** —— [QTEASY教程1](1-get-started.md)
source: **Install and configure `qteasy`** —— [QTEASY教程1](1-get-started.md)
de: ** Installieren, Konfigurieren von `qteasy` ** -- [QTEASY Tutorial 1](1-get-started.md)

# **设置了一个本地数据源**，并已经将足够的历史数据下载到本地——[QTEASY教程2](2-get-data.md)
source: **Set up a local data source**, and have downloaded enough historical data to the local ——[QTEASY教程2](2-get-data.md)
de: **eine lokale Datenquelle einrichten** und genügend historische Daten lokal heruntergeladen haben - [QTEASY Tutorial 2](2-get-data.md)

# **学会创建交易员对象，使用内置交易策略**，——[QTEASY教程3](3-start-first-strategy.md)
source: **Learn to create a trader object, use built-in trading strategies** ——[QTEASY教程3](3-start-first-strategy.md)
de: **Lernen Sie, Händlerobjekte zu erstellen und integrierte Handelsstrategien zu verwenden**, - [QTEASY Tutorial 3](3-start-first-strategy.md)

# **学会使用混合器，将多个简单策略混合成较为复杂的交易策略**——[QTEASY教程4](4-build-in-strategies.md)
source: **Learn to use the mixer to mix multiple simple strategies into more complex trading strategies** ——[QTEASY教程4](4-build-in-strategies.md)
de: **Lernen Sie, einen Mixer zu verwenden, um mehrere einfache Strategien zu komplexeren Handelsstrategien zu verbinden** - [QTEASY Tutorial 4](4-build-in-strategies.md)

source: **Understand how to customize trading strategies** ——[QTEASY教程5](5-first-self-defined-strategy.md)[QTEASY教程6](6-more-self-defined-strategies.md)
de: ** Lernen Sie, wie man Handelsstrategien anpasst** - [QTEASY Tutorial 5](5-erste-selbst-definierte-Strategie.md) [QTEASY Tutorial 6](6-weitere-selbst-definierte-Strategien. md)

source: In the [QTEASY documentation](https://qteasy.readthedocs.io/zh/latest/), you can find more information about using built-in trading strategies, creating custom strategies, and so on. If you are not familiar with the basic usage of `qteasy`, you can go there to see more detailed instructions.
de: Weitere Informationen über die Verwendung der integrierten Handelsstrategien, die Erstellung benutzerdefinierter Strategien und mehr finden Sie in der [QTEASY-Dokumentation] (https://qteasy.readthedocs.io/zh/latest/). Für diejenigen unter Ihnen, die mit den Grundlagen der Verwendung von `qteasy` nicht vertraut sind, finden Sie dort eine ausführliche Anleitung.

# `qteasy`的内核被设计为一个兼顾高速执行以及足够的灵活性的框架，理论上您可以实现您所设想的任何类型的交易策略。
source: The kernel of `qteasy` is designed as a framework that balances high-speed execution and sufficient flexibility. In theory, you can implement any type of trading strategy you can imagine.
de: Der `qteasy`-Kernel ist als Rahmenwerk konzipiert, das hohe Ausführungsgeschwindigkeiten mit ausreichender Flexibilität kombiniert, so dass Sie theoretisch jede Art von Handelsstrategie umsetzen können, die Sie sich vorstellen.

source: Meanwhile, `qteasy`'s backtesting framework has also been specially designed to completely avoid you inadvertently importing "future functions" into your trading strategy, ensuring that your trading strategy is completely based on past data during backtesting. At the same time, many preprocessing techniques and JIT technologies have been used to compile the kernel's key functions to achieve a running speed no less than that of C.
de: Gleichzeitig wurde das Backtesting-Framework `qteasy` auf eine ganz besondere Art und Weise entwickelt, um zu verhindern, dass Sie versehentlich `Future-Funktionen` in Ihre Handelsstrategie importieren, um sicherzustellen, dass Ihre Handelsstrategie ausschließlich auf der Grundlage von Daten aus der Vergangenheit backgetestet wird, und um eine Vielzahl von Vorverarbeitungstechniken und JIT-Techniken zur Kompilierung der Schlüsselfunktionen des Kernels zu verwenden, um die Geschwindigkeit der Sprache C zu erreichen.

source: However, in order to achieve theoretically infinite possible trading strategies, it may not be enough to use only built-in trading strategies and strategy mixing. Some specific trading strategies, or some particularly complex trading strategies, cannot be created by mixing built-in strategies. This requires us to use the `Strategy` base class provided by `qteasy` to create a custom trading strategy based on certain rules.
de: Um jedoch eine theoretisch unendliche Anzahl von Handelsstrategien zu erreichen, reicht es nicht immer aus, nur die eingebauten Handelsstrategien zu verwenden und Strategien zu mischen. Einige spezifische Handelsstrategien oder besonders komplexe Handelsstrategien können nicht durch das Mischen der eingebauten Strategien erstellt werden, so dass wir die von `qteasy` bereitgestellte Basisklasse `Strategy` verwenden müssen, um eine benutzerdefinierte Handelsstrategie auf der Grundlage bestimmter Regeln zu erstellen. Strategie auf der Grundlage bestimmter Regeln.

# 本节的目标
source: Target of this tutorial
de: Ziele dieses Abschnitts

# 在本节中，我们将介绍`qteasy`的交易策略基类，通过一个具体的例子详细讲解如何基于这几个基类，创建一个只属于您自己的交易策略。为了说明
source: In this tutorial, we will introduce the trading strategy base class of `qteasy`, and explain in detail how to create your own trading strategy based on these base classes through a specific example. To illustrate
de: In diesem Abschnitt stellen wir Ihnen die `qteasy` Handelsstrategie-Basisklassen vor und erklären Ihnen anhand eines konkreten Beispiels, wie Sie auf der Grundlage dieser Basisklassen eine eigene Handelsstrategie erstellen können. Zur Veranschaulichung

# 继承Strategy类，创建一个复杂的多因子选股策略
source: Create a complex multi-factor stock selection strategy by inheriting the Strategy class
de: Vererben Sie die Klasse Strategy, um eine komplexe Multi-Faktor-Strategie zur Aktienauswahl zu erstellen.

# 在这个例子中，我们使用
source: In this example, we use
de: In diesem Beispiel verwenden wir die

# 策略和回测参数配置，并开始回测
source: Parameters configuration and backtesting
de: Strategie- und Backtesting-Parameter werden konfiguriert und das Backtesting beginnt

# 定义好上面的策略之后，就可以开始进行回测了，我们需要在`qteasy`中创建一个交易员对象，操作前面创建的策略：
source: When the above strategy is defined, we can start backtesting. We need to create a trader object in `qteasy` and operate the strategy created earlier:
de: Nachdem wir die obige Strategie definiert haben, können wir mit dem Backtesting beginnen. Dazu müssen wir ein Trader-Objekt in `qteasy` erstellen, das die zuvor erstellte Strategie ausführt:

# 运行结果如下：
source: Results are as follows:
de: Die Ergebnisse des Laufs sind wie folgt:

# 本节回顾
source: Recap
de: Rückblick auf diesen Abschnitt

source: In this tutorial, we explained in detail how to create your own trading strategy based on the trading strategy base class of `qteasy` through a specific example. Through this example, you can see that the trading strategy base class of `qteasy` provides sufficient flexibility to implement any type of trading strategy you can imagine.
de: In diesem Abschnitt erklären wir Ihnen anhand eines konkreten Beispiels, wie Sie auf der Grundlage der Handelsstrategie-Basisklasse von `qteasy` eine eigene Handelsstrategie erstellen können. Anhand dieses Beispiels können Sie sehen, dass die Handelsstrategie-Basisklasse von `qteasy` genügend Flexibilität bietet, um jede Art von Handelsstrategie zu implementieren, die Sie sich vorstellen.

# 从下一个教程开始，我们将会介绍`qteasy`交易策略优化方法，通过多种优化算法，找到最优的交易策略参数，以及评价交易策略的性能。
source: Starting from the next tutorial, we will introduce the trading strategy optimization method of `qteasy`, find the optimal trading strategy parameters through various optimization algorithms, and evaluate the performance of the trading strategy.
de: Im nächsten Tutorial stellen wir Ihnen die Methode zur Optimierung der Handelsstrategie `qteasy` vor, die verschiedene Optimierungsalgorithmen verwendet, um die optimalen Parameter der Handelsstrategie zu finden und die Leistung der Handelsstrategie zu bewerten.
