Repository: 18773262/qteasy
Catalog: docs/source/locale/*/LC_MESSAGES/references/2-get-history-data.po
Languages: de

source: 下面是更多的K线图例子，展示了股票、基金、指数等不同的资产类别，不同的数据频率，不同的均线设定、不同的图表类型等
de: Nachfolgend finden Sie weitere Beispiele für K-Charts, die verschiedene Anlageklassen wie Aktien, Fonds, Indizes usw., verschiedene Datenfrequenzen, verschiedene SMA-Einstellungen, verschiedene Charttypen usw. zeigen. Um die K-Charts in den folgenden Beispielen anzeigen zu können, müssen Sie die entsprechenden Daten herunterladen.
